[
  {
    "hex_coord": [
      4,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      0,
      121,
      215,
      312,
      422
    ],
    "summary": "The visual analytics system interface, TemporalFlowViz, is designed to facilitate expert reasoning in combustion simulation analysis through various integrated components. It includes a Filtering Panel to set initial parameters and perform clustering, a Temporal Trajectory View to visualize the results of these clusterings, and a Similar Trajectories View to compare the most similar cases. Additionally, there is a Report View for displaying AI-generated or expert annotations, and a Details View for examining flow field frames. This system supports semantic summarization and report generation, aligning with the requirement for enhanced reasoning capabilities (supports R3). The setup and evaluation of the system involve comparing cases over different time steps, such as $t_i$ and $t_j$, to assess its effectiveness. E2, an aerospace engineer specializing in propulsion system development, likely contributes to this evaluation process."
  },
  {
    "hex_coord": [
      6,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      1,
      222
    ],
    "summary": "The TemporalFlowViz system is designed with a visual analytics interface that comprises multiple components, each serving distinct functions in line with the system's objectives. The workflow within this system is structured to facilitate expert-driven visual analytics goals, supporting specialists in effectively analyzing temporal data through a cohesive and multi-faceted interface."
  },
  {
    "hex_coord": [
      2,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      2,
      101,
      102,
      158,
      159,
      230,
      249,
      317,
      325,
      374,
      479,
      545,
      557,
      571
    ],
    "summary": "The paper discusses the KERP approach for medical report generation, which is divided into three main steps. The first step involves encoding visual features from medical images into a structured abnormality graph that informs subsequent processes. These domain-informed requirements are crucial as they lay the foundation for both the system pipeline and the interaction design, ensuring that the generated reports meet professional standards. The *Filtering Panel* plays a key role by offering initial parameter filters, case selection options, and clustering parameters to streamline the analysis. Cropped inputs, compared to entire frames, facilitate the formation of more compact clusters and clearer trajectory convergence, which is observed when using UMAP for dimensionality reduction and clustering via DBSCAN. The trajectory convergence radius, defined as r_i = (1/K) ∑_{t=t_i-K+1}^{t_i} ||p_i(t) - overline{p_i}||, helps quantify how trajectory points cluster over time. This precise clustering is instrumental in retrieving the top-k most similar cases based on similarity scores, aiding in effective case triaging or grouping, even in scenarios involving hundreds of cases. The system's user interface allows for interactive functionalities such as zoom, pan, and tooltips, enhancing user engagement and comprehension of data. Moreover, the developed semantic report generation mechanism is valuable for facilitating communication across experts, despite inherent subjectivities introduced in cluster centroid annotation. Overall, the system demonstrates robust capabilities in handling the nuanced requirements of medical case analysis, fostering greater collaboration among professionals."
  },
  {
    "hex_coord": [
      4,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      3,
      220,
      318,
      377,
      385,
      387,
      419,
      421,
      551
    ],
    "summary": "The paper presents a visualization approach that includes the Temporal Trajectory View and the Similar Trajectories View to enhance the analysis of clustering results and temporal trajectories in latent space. The Temporal Trajectory View offers a clear visualization of the clustering outcomes and the temporal progression of a selected case, while the Similar Trajectories View highlights the top-k most similar cases to facilitate comparative reasoning. This dual layout aids in the rapid visual comparison of trajectory shapes, cluster transitions, and stabilization patterns. Selecting a trajectory within these views allows users to navigate directly to the corresponding frames in the Details View and Report View, promoting effective communication. The approach was evaluated in two case studies, designed to mimic practical scenarios of independent exploration, where the integration of these views was met with positive feedback."
  },
  {
    "hex_coord": [
      0,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      4,
      5,
      212,
      217,
      511,
      515
    ],
    "summary": "The study introduces a comprehensive framework that leverages various visual and analytical views to facilitate the assessment and understanding of temporal trajectories in simulation cases. The *Similar Trajectories View* is utilized to identify and draw the three most similar temporal trajectories out of different cases, thereby aiding in comparative analysis. The *Temporal Trajectory View* enables experts to evaluate mode transitions by providing a dynamic visual depiction of trajectory shifts over time. Complementing this, the *Report View* offers AI-generated or expert-annotated descriptions for selected frames, derived from the *Temporal Trajectory View*, enhancing interpretability. This system employs a vision-language model to produce detailed summaries of individual frames. Moreover, the framework includes a scatter plot illustration, highlighting clusters with centroids enveloped by dashed circles. This visualization aids users in inspecting frame descriptions or generating new ones based on chosen embeddings. Descriptions for frames in a selected case are generated using information from the frames and descriptions nearest to the corresponding centroids, ensuring contextually relevant and precise summaries."
  },
  {
    "hex_coord": [
      2,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      6,
      42,
      90,
      98,
      100,
      141,
      196,
      279,
      357,
      390,
      406,
      435,
      475,
      482,
      592,
      599,
      601
    ],
    "summary": "The discussed paper presents a novel framework for analyzing temporal flow field data, integrating machine learning and visualization techniques to enhance interpretability and knowledge sharing. It uses dimensionality reduction techniques, such as t-SNE and UMAP, to reveal transitional behaviors in temporal data. Although t-SNE is less effective for temporal reasoning, the framework leverages trajectory-based exploration and analysis through TemporalFlowViz, where users can interactively select cases and view detailed flow field frames in the *Details View*. The right panel of the system displays case-level summaries by aggregating outputs from individual simulation timesteps, enabling insightful comparisons of dynamic phenomena. The approach incorporates large language model (LLM) agents to automate text summarization, integrating knowledge-driven encoding and retrieval mechanisms. Despite the lack of structured mechanisms for expertise sharing with automated systems, the system facilitates scalability in labeling scientific phenomena and identifying recurring knowledge patterns across extensive simulation data. Expert feedback highlights its efficacy in accelerating hypothesis validation, reducing cognitive load, and promoting cross-team knowledge dissemination."
  },
  {
    "hex_coord": [
      0,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      7,
      46,
      487,
      500
    ],
    "summary": "Ensuring the advancement of high-speed propulsion technologies necessitates a comprehensive understanding of the complex combustion dynamics within scramjet engines. To aid in this endeavor, visual analytics systems are employed to enhance the interpretability of such dynamics by effectively linking latent embeddings with raw simulation frames. Additionally, the research highlights the E3 model, which aids in accelerating the correction of inappropriate combustion-mode descriptions, thus improving accuracy in analysis. Furthermore, the E4 model contributes by adjusting parameters to refine the separation of trajectory groups, thereby ensuring a more precise characterization of combustion behavior. Together, these tools and methods facilitate a more nuanced exploration and evaluation of scramjet combustion processes."
  },
  {
    "hex_coord": [
      -11,
      0
    ],
    "country": 0,
    "MSU_ids": [
      8,
      251,
      361,
      446,
      564
    ],
    "summary": "The study addresses the challenges of visual interpretation, feature differentiation, and cross-case comparison due to the large scale and high dimensionality of simulation-generated temporal flow field data. To tackle these issues, the researchers focus on using cropped inputs centered on the isolator–cavity region as the default configuration throughout their data processing pipeline. In the Clustering Parameters subsection, the parameters *minSamples* and *eps* are crucial, though currently, clustering depends on manually selected values for these parameters. The research includes the observation of spatiotemporal pressure evolution across three selected cases (a1–c1), showcasing the practical application of their methods in analyzing complex flow data."
  },
  {
    "hex_coord": [
      4,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      9,
      543,
      583
    ],
    "summary": "In this paper, we introduce TemporalFlowViz, a sophisticated visual analytics workflow and system specifically designed to facilitate expert-driven exploration, clustering, and interpretation of temporal flow-field data obtained from scramjet combustion simulations. TemporalFlowViz empowers users with a parameter-aware approach that streamlines the visualization process, allowing for efficient clustering and in-depth analysis of complex temporal dynamics in combustion fields. Notably, it enables the validation of combustion behavior without the need for exhaustive frame-by-frame inspections, thereby enhancing the efficiency of the analysis process and providing valuable insights into scramjet combustion mechanisms."
  },
  {
    "hex_coord": [
      -10,
      0
    ],
    "country": 0,
    "MSU_ids": [
      10,
      169
    ],
    "summary": "The study utilizes a comprehensive approach that involves hundreds of simulated combustion scenarios, each with distinct initial conditions. These simulations generate time-sequenced flow field images, contributing to a substantial dataset. This dataset comprises approximately 3 terabytes of detailed flow field information, enabling in-depth analysis and insights into the combustion processes."
  },
  {
    "hex_coord": [
      -10,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      11,
      35,
      236,
      253,
      254,
      269,
      493
    ],
    "summary": "In this study, pretrained Vision Transformers (ViTs) are utilized to extract high-dimensional embeddings from multichannel flow field frames, which are represented as $X_i(t) = [P_i(t), OH_i(t), ...]$. ViTs have proven effective in capturing semantically rich features from images, making them suitable for this task. The embedding process employs a pretrained ViT and can optionally involve a spatial weighting matrix $W_P$, which allows for domain-specific adjustments such as assigning higher weights to the upper region of the engine. TemporalFlowViz facilitates this approach by decoupling the embedding process from downstream analytical components, ensuring flexibility and efficiency in feature extraction."
  },
  {
    "hex_coord": [
      2,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      12,
      451,
      585
    ],
    "summary": "In the study, dimensionality reduction techniques combined with density-based clustering were employed to reveal latent combustion modes within high-dimensional datasets. The initial two frames in each series (specifically labeled a2–c2) highlighted surge positions located between the isolator and cavity, indicative of the early-stage scramjet ignition process. Furthermore, the TemporalFlowViz tool was utilized to facilitate the interpretable analysis of the time-sequenced combustion data, enabling researchers to effectively examine and understand complex high-dimensional patterns and transformations occurring during combustion events."
  },
  {
    "hex_coord": [
      -3,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      13
    ],
    "summary": "In this study, we develop temporal trajectories within the embedding space to systematically monitor and track the evolution of each simulation over time. This approach enables us to analyze the dynamic changes and progressions within the simulations, providing a comprehensive understanding of their developmental processes as they unfold."
  },
  {
    "hex_coord": [
      -6,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      14,
      324,
      466
    ],
    "summary": "Domain specialists play a crucial role in bridging the gap between latent representations and expert reasoning by annotating representative cluster centroids with descriptive labels. This process facilitates the interpretable summarization of latent flow field structures, enhancing the comprehensibility of complex data analyses. To further illustrate the integration of these elements, a zoomed-in view is presented in Figure 6a1, complemented by frame snapshots depicted in section (af). Together, these components provide a comprehensive and interpretable visualization of the structured data, aiding in the effective communication of domain-specific insights."
  },
  {
    "hex_coord": [
      -2,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      15,
      97,
      547,
      563
    ],
    "summary": "The framework employs annotations as contextual prompts for a vision-language model, enabling the generation of natural-language summaries for individual frames and full simulation cases. Through the integration of LLM agents, the framework automates code generation, facilitating more efficient simulation processes. A shared semantic layer is incorporated, allowing experts to explain, compare, or question simulation behavior collaboratively. Additionally, various design choices within this framework present opportunities for future enhancement, indicating potential avenues for continued development and optimization."
  },
  {
    "hex_coord": [
      4,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      16,
      200,
      298,
      359,
      389,
      420,
      527,
      528
    ],
    "summary": "The paper discusses a system designed to enhance in-depth analysis through multiple integrated features. The system facilitates parameter-based filtering and similarity-based case retrieval, while also enabling coordinated multi-view exploration to assist users in their analytical processes. Through expert-guided semantic summarization, the system achieves parameter-aware case comparison, helping users understand and compare different cases effectively. Cases are chronologically connected in the 2D latent space to form trajectories, allowing for intuitive exploration of temporal sequences. Sorting by column headers empowers experts to prioritize cases efficiently for further analysis. The Details View provides a comprehensive scrollable view, displaying the full temporal sequence of flow field frames in scientific visualizations, specifically for chosen cases. To validate the effectiveness of TemporalFlowViz, case studies were conducted, reflected through interviews to gather insights on system usability, interpretability, and analytical value. These sessions aimed to assess how well the system facilitates specific analytical tasks, ensuring its usability and effectiveness in real-world workflows."
  },
  {
    "hex_coord": [
      3,
      -11
    ],
    "country": 0,
    "MSU_ids": [
      17,
      63,
      108,
      117,
      123,
      192,
      214,
      246,
      386,
      485,
      513,
      540,
      574
    ],
    "summary": "Our study introduces TemporalFlowViz, a system designed to enhance the analysis and interpretation of temporal data through the integration of large language models (LLMs). The system improves outputs from multiple CAD networks by efficiently summarizing and reorganizing information into coherent natural language text. We validated the system’s effectiveness through two expert-informed case studies, garnering feedback from structured interviews and co-design sessions with domain experts E1 and E2, who represent diverse perspectives from academic and engineering fields. TemporalFlowViz addresses four core requirements, including temporal summarization and trajectory-based pattern analysis, crucial for anomaly assessment. The system's Temporal Trajectory View enables experts to detect anomalies by providing a detailed visualization of temporal trajectories, where selecting a trajectory can dynamically update the main view. Cropped inputs result in tighter clustering, facilitating more convergent trajectory analysis. The design features, such as dashed circles around centroids, aid in visual interpretation. Furthermore, TemporalFlowViz promotes knowledge transfer and interpretive consistency across teams, with plans for future versions to include collaborative validation mechanisms for efficient consensus building. We have summarized our contributions, highlighting the system’s capability in supporting expert analysis and decision-making processes."
  },
  {
    "hex_coord": [
      2,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      18,
      66,
      88,
      223
    ],
    "summary": "TemporalFlowViz and FlowVisual, both innovative visualization tools, significantly advance the analysis of complex flow-field imagery in scramjet combustion studies. TemporalFlowViz facilitates hypothesis generation, supports interpretable pattern discovery, and enhances knowledge acquisition in large-scale combustion analyses. Meanwhile, FlowVisual integrates 3D volume rendering with glyph techniques to effectively convey fluid concepts. Together, these advancements establish a robust foundation for representing intricate flow phenomena, with the analytical pipeline incorporating spatially focused preprocessing to optimize data interpretation."
  },
  {
    "hex_coord": [
      6,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      19,
      47,
      56,
      186,
      201,
      294,
      358
    ],
    "summary": "TemporalFlowViz is a parameter-aware visual analytics system designed to facilitate multi-view exploration. This system serves as the empirical foundation for our visual analytics workflow, integrating all processes through a unified platform. Key features of TemporalFlowViz include the ability to initiate visualizations by clicking the 'Draw Scatter Plot' button, which allows users to easily interact with the data. Additionally, the system employs UMAP for dimensionality reduction, as illustrated in the bottom two plots, providing users with insightful visual representations. Through these capabilities, TemporalFlowViz enhances the exploration and analysis of complex datasets in a coherent manner."
  },
  {
    "hex_coord": [
      -5,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      20,
      454
    ],
    "summary": "The study focuses on the analysis of temporal flow fields, utilizing advanced methodologies to interpret these dynamic systems. Specifically, the research employs InternViT to process the cropped pressure field frames, enabling a detailed examination of the temporal variations and patterns. This approach allows for a more nuanced understanding of the underlying mechanisms governing the flow dynamics."
  },
  {
    "hex_coord": [
      3,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      21,
      94,
      127,
      280,
      404
    ],
    "summary": "The paper discusses techniques for handling high-dimensional temporal data, which can often lead to information overload. To address this, the authors explore UMAP (Uniform Manifold Approximation and Projection) for dimensionality reduction, highlighting its ability to preserve both local and global structural continuity effectively. This is particularly useful in scientific data simulation, where maintaining the integrity of data structures is crucial. Additionally, spectral clustering is employed as a commonly used method to organize and interpret the data. Ultimately, the combination of these methods facilitates the linkage of low-level visual data to expert interpretation, enhancing the analysis and understanding of complex datasets."
  },
  {
    "hex_coord": [
      -7,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      22,
      85,
      247,
      258
    ],
    "summary": "The discussed paper focuses on Vision Transformers, which model images by representing them as sequences of patch embeddings. The study reveals that when using whole-frame inputs, the resulting distributions tend to be more scattered and noisy. To address this, the authors extracted frame-level embeddings specifically from the same cropped input images for each model, leading to more coherent and refined outcomes in the analysis of visual data."
  },
  {
    "hex_coord": [
      -1,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      23,
      308,
      373,
      423
    ],
    "summary": "Supersonic combustion within scramjet engines is crucial for the achievement of continuous hypersonic flight. To analyze this, the trajectories $p_i(\\cdot)$ and $p_j(\\cdot)$ are differentiated using a time-warped alignment method, which helps in assessing the similarities and differences between combustion processes. By examining the trajectory of individual cases, researchers can determine whether a process maintains stability, undergoes mode transitions, or exhibits oscillatory behavior. These cases are specifically designed to test the system's efficacy in recognizing patterns during combustion simulation analysis, which is vital for optimizing scramjet engine performance."
  },
  {
    "hex_coord": [
      -2,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      24,
      542
    ],
    "summary": "Computational simulations are essential for analyzing the intricate interactions between turbulence, chemical kinetics, and thermal effects in high-speed propulsion systems. By labeling a single instance and observing its repetition across numerous similar cases, researchers can validate combustion behavior on a large scale, providing critical insights into these complex systems."
  },
  {
    "hex_coord": [
      -11,
      1
    ],
    "country": 0,
    "MSU_ids": [
      25,
      180,
      237,
      428,
      495,
      503,
      534,
      579
    ],
    "summary": "The computational simulations in the study generated high-resolution, sequential flow field images under various initial conditions, capturing detailed data at each timestep. The CFD solver provided outputs for multiple physical fields, specifically static pressure, OH mass fraction, velocity, and Mach number. These outputs are represented as $P_i(t)$ and $OH_i(t)$, indicating the pressure and hydroxyl fields at each time step t for different simulation cases. Case Study 1 primarily investigated the evolution of the pressure field, noting that regions with less activity, like the domain's left portion, were assigned smaller weights. The hydroxyl field snapshots corresponding to these cases were displayed in specific regions labeled as (f1)–(f3). Furthermore, the visualization tool, TemporalFlowViz, showed adaptability to various phenomena, including scenarios of blowout or reignition, thus demonstrating its applicability across diverse flow events."
  },
  {
    "hex_coord": [
      -3,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      26,
      43,
      92,
      305,
      391
    ],
    "summary": "The study addresses the challenges posed by massive and high-dimensional datasets, particularly in the context of analyzing temporal flow field data. It highlights the effectiveness of density-based clustering methods, such as DBSCAN, which are used to uncover latent patterns within these complex datasets. These methods cluster data points by utilizing appropriate density functions, including density-based spatial clustering techniques capable of managing noise. Experts assess various formulations to determine their proficiency in capturing perceptual similarities among data points. An interactive feature allows users to click on a frame within the scatter plot to emphasize its embedding, thereby facilitating a more intuitive understanding of the data's structure."
  },
  {
    "hex_coord": [
      -1,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      27,
      144
    ],
    "summary": "The high dimensionality and vast scale of the data present considerable challenges for downstream analysis and expert interpretation. To address these challenges, experts require tools and methodologies that assist in identifying and comparing cases exhibiting similar behaviors under varying initial conditions. Such support is crucial for effectively interpreting complex datasets and drawing meaningful insights."
  },
  {
    "hex_coord": [
      -9,
      3
    ],
    "country": 0,
    "MSU_ids": [
      28,
      178,
      509,
      512,
      517
    ],
    "summary": "In traditional combustion analysis, performance is evaluated using scalar metrics, which provide a quantitative basis for assessment. One critical factor influencing combustion behavior is the water vapor content, as it affects the mixture equivalence ratio and thereby influences the combustion process. Specifically in the jet-wake combustion mode, the flame originates directly at the fuel inlet and develops into a broad, curved tail that forms a large flame wake along the upper region of the field. This spatial distribution of combustion features can be effectively visualized through dimensionality reduction techniques, where centroids of clusters are highlighted with diamonds to signify key structural patterns in the flame dynamics."
  },
  {
    "hex_coord": [
      -11,
      3
    ],
    "country": 0,
    "MSU_ids": [
      29,
      129,
      164,
      364
    ],
    "summary": "The study presents an advanced CFD platform designed for modeling high-speed reactive flows, which provides a deeper analysis of combustion processes. Traditional scalar metrics, such as ignition delay, pressure rise, and thrust efficiency, offer only limited insights into the spatial and temporal transitions occurring during combustion. The developed CFD platform allows for the exploration of how various physical variables impact the latent structures and cluster formations within these reactive flows, thus enhancing the understanding of the complex phenomena beyond what scalar metrics can offer."
  },
  {
    "hex_coord": [
      -12,
      1
    ],
    "country": 0,
    "MSU_ids": [
      30,
      51,
      172,
      363,
      481
    ],
    "summary": "This paper discusses the limitations of certain metrics in providing a comprehensive understanding of the spatial and temporal structures in reactive flows. Implicit knowledge is crucial for understanding key elements such as the position of flame fronts, shock structures, and pressure gradients, which significantly influence these flows. Notably, static pressure plays a vital role in controlling upstream compression. The flow fields are characterized by critical components including pressure, OH concentration, and Mach number. The detailed flow field configurations are visually represented in figure (af) of the study, offering further insights into the discussed phenomena."
  },
  {
    "hex_coord": [
      -9,
      0
    ],
    "country": 0,
    "MSU_ids": [
      31
    ],
    "summary": "The metrics discussed in the paper are instrumental in providing an overview of global trends. By systematically analyzing and summarizing these patterns, the metrics enable researchers to gain insights into broader developments and shifts across various fields, facilitating a comprehensive understanding of global dynamics."
  },
  {
    "hex_coord": [
      -8,
      3
    ],
    "country": 0,
    "MSU_ids": [
      32,
      489
    ],
    "summary": "The study aimed to enhance the understanding of the effect of initial conditions on combustion dynamics, with a specific focus on the behavior of the hydroxyl radical (OH) field. By examining how these initial conditions influence the distribution and behavior of OH radicals, the research provides valuable insights that can inform domain experts seeking to optimize combustion processes."
  },
  {
    "hex_coord": [
      2,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      33,
      99,
      136,
      424,
      525
    ],
    "summary": "Li et al. present a novel approach that addresses the increasing need for exploratory, interpretable, and human-in-the-loop analysis tools for large-scale simulation data, specifically focusing on generating accurate and robust medical image reports. Recognizing the labor-intensive nature of manual inspection, the approach leverages a combination of trajectory views, spatial clustering, and multiframe comparison to enhance diagnostic insight. This method is particularly evaluated in the context of combustion simulation analysis, where its effectiveness in supporting semantic interpretation across multiple simulation cases is thoroughly assessed."
  },
  {
    "hex_coord": [
      -6,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      34,
      53,
      83,
      185
    ],
    "summary": "Recent advances in deep learning have led to promising solutions in the domain of vision–language models (VLMs), which provide mechanisms for converting visual input into natural language descriptions. These developments are supported by unsupervised methods like stacked denoising autoencoders that learn compact representations through the reconstruction of corrupted inputs. In practical applications, such as analyzing flow fields inside engines, images are carefully cropped to eliminate excessive background regions, thereby generating cleaner visual representations. This clean visual data can then be efficiently processed by VLMs to produce accurate and descriptive language outputs."
  },
  {
    "hex_coord": [
      -1,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      36,
      114,
      245,
      486
    ],
    "summary": "Vision Transformers (ViTs) represent images as sequences of patches, which allows for efficient processing of visual data. This method circumvents the need for expensive full fine-tuning of large language models (LLMs), optimizing computational resources. By projecting both inputs into a UMAP-reduced latent space, it enables effective dimensionality reduction while preserving data integrity. This feature was positively evaluated by E3, indicating its effectiveness and potential value in relevant applications."
  },
  {
    "hex_coord": [
      -2,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      37,
      231
    ],
    "summary": "The study explores the potential of applying Vision Transformers (ViTs) to fluid dynamics, particularly in effectively capturing the structural complexity involved in scientific visualizations. This is demonstrated by comparing UMAP-projected trajectories, which utilize pressure field embeddings derived from entire frames, thereby offering a comprehensive analysis of the fluid dynamics data."
  },
  {
    "hex_coord": [
      -7,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      38,
      84,
      341,
      402
    ],
    "summary": "Vision Transformers (ViTs) have been effectively utilized for learning Partial Differential Equation (PDE) operators, showcasing their adaptability in complex mathematical modeling tasks. In a similar domain, stacked denoising autoencoders have demonstrated successful applications in clustering and anomaly detection, highlighting their capability in identifying patterns and irregularities within data sets. Both methodologies serve as context inputs to the Gemma-3 framework, which integrates these inputs for enhanced performance. Complementarily, the vision-language model generates frame-specific descriptions, providing detailed contextual information that enhances the interpretability and accuracy of the overall system."
  },
  {
    "hex_coord": [
      -10,
      1
    ],
    "country": 0,
    "MSU_ids": [
      39,
      181,
      594
    ],
    "summary": "Vision Transformers (ViTs) have been effectively utilized in the field of particle image velocimetry, marking a significant advancement in analyzing complex fluid dynamics. In the realm of combustion analysis, domain experts have highlighted the critical importance of accurately identifying the pressure field and the hydroxyl (OH) field for a comprehensive interpretation of combustion processes. TemporalFlowViz emerges as a powerful framework that integrates deep learning techniques, trajectory-based reasoning, and semantic interpretability, facilitating an enhanced understanding of combustion dynamics on a large scale. This unified approach enables a more detailed and scalable analysis, crucial for advancing research in combustion dynamics."
  },
  {
    "hex_coord": [
      3,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      40,
      95,
      118,
      138,
      199,
      211,
      226,
      227,
      277,
      282,
      291,
      356,
      476,
      501,
      532,
      580,
      588
    ],
    "summary": "Dimensionality reduction techniques such as t-SNE and UMAP are employed to uncover latent patterns in temporal flow field data. t-SNE is adept at maintaining local neighborhood relationships, while UMAP excels in preserving cluster boundaries. These techniques underpin various methodologies, including ensemble clustering and non-negative matrix factorization-based clustering. To address real-world analytical challenges, we conducted structured interviews and co-design sessions, leading to the development of a comprehensive pipeline. This pipeline integrates the construction of temporal trajectories and cluster-based semantic summarization. Each simulation's temporal trajectory is formed by chronologically connecting the embeddings of frames, providing a semantic communication framework (R3) through trajectory modeling. This process is supported by a reusable semantic layer designed to transform complex flow field patterns into interpretable textual narratives. Users can interact with these semantic summaries and access detailed temporal trajectories within designated regions, such as region (s1), through intuitive interfaces like the Selected Cases Table. Despite certain semantic support limitations in knowledge communication, these constraints offer avenues for refinement rather than indicating fundamental flaws in the methodology."
  },
  {
    "hex_coord": [
      3,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      41,
      286,
      408
    ],
    "summary": "Dimensionality reduction techniques, such as t-SNE and UMAP, are extensively utilized to uncover combustion modes in temporal flow field data. Among these, UMAP is noted for producing cleaner latent clusters, which facilitates easier annotation and interpretation. This capability is part of a broader framework where these methodologies, along with other analytical views, integrate into a cohesive environment for comprehensive data analysis."
  },
  {
    "hex_coord": [
      -3,
      1
    ],
    "country": 0,
    "MSU_ids": [
      44,
      250,
      522
    ],
    "summary": "Density-based clustering methods, like DBSCAN, have been extensively employed to reveal combustion modes within temporal flow field data. The findings indicate that concentrating on regions identified by experts enhances the clarity of latent structures and improves the separability of combustion modes. This approach facilitates a robust classification of combustion types, effectively accommodating internal oscillations."
  },
  {
    "hex_coord": [
      -6,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      45,
      307,
      519
    ],
    "summary": "Density-based clustering methods, such as DBSCAN, have been extensively employed to reveal transitional behaviors within temporal flow field data. Specifically, the research concentrated on analyzing late-stage behaviors associated with convergence and stabilization. Throughout these phases, fluctuations in the data consistently remained within the same cluster, indicating a stable pattern despite the transitions. This approach allows for a clearer understanding of how data points evolve over time while remaining interconnected under consistent clustering parameters."
  },
  {
    "hex_coord": [
      6,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      48,
      74,
      189,
      276,
      348,
      550
    ],
    "summary": "In the presented research, we introduced TemporalFlowViz, an end-to-end visual analytics workflow and system designed to enhance trajectory-based reasoning. A core component of effective visual analytics systems is robust image representation, which is integral to facilitating such reasoning processes. TemporalFlowViz incorporates an interface consisting of five tightly coordinated interactive views that enable users to quickly and intuitively understand simulation data. This system employs UMAP projections, as depicted in the bottom two plots, to assist in dimensionality reduction and improve data interpretation. The interactive views have been well-received, highlighting their effectiveness in promoting rapid comprehension and intuitive analysis within the visual analytics framework."
  },
  {
    "hex_coord": [
      -7,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      49,
      445
    ],
    "summary": "Despite the advances achieved, several key challenges persist. In addressing these challenges, simulation cases were filtered using the Filtering Panel to impose constraints on initial conditions like pressure, temperature, and humidity. This approach helps in refining the parameters for better accuracy in simulations."
  },
  {
    "hex_coord": [
      -11,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      50,
      82,
      109,
      128,
      228,
      315,
      496,
      578
    ],
    "summary": "In analyzing flow behavior, expert interpretation typically draws upon implicit knowledge, which is essential for understanding the complex outputs from simulations. Each simulation generates multiple time-sequenced flow field frames, requiring sophisticated methods to translate these into meaningful interpretations. To address this, the architecture incorporates various components such as diagnosis, lesion segmentation, and report generation networks, collectively forming CAD networks. These networks facilitate the transformation of complex simulation outputs into interpretable latent structures. A key aspect of this process involves encoding weighted OH field images into high-dimensional embeddings using a pretrained BLIP-2 Vision Transformer (ViT) model, and leveraging residual connections, as introduced by ResNet, to support the training of deep architectures. Additionally, more expressive representations can be achieved through techniques such as hierarchical time-scale embedding or event-aware trajectory segmentation. To ensure accuracy despite minor temporal shifts that do not influence the overall flow behavior, specific metrics have been developed. These integrated methodologies enable a more nuanced and accessible interpretation of simulation data."
  },
  {
    "hex_coord": [
      -4,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      52,
      319,
      376
    ],
    "summary": "In traditional embedding pipelines, certain elements are not automatically encoded or explained, which presents challenges in processing and interpreting data. To address this, similarity scores can be utilized to construct a retrieval basis that aids in the downstream interpretation of data. Furthermore, users can manage the display of cluster centroids by using the 'Hide Centroids / Show Centroids' button, thereby enhancing their ability to visualize and interact with the data more effectively."
  },
  {
    "hex_coord": [
      2,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      54,
      60,
      61,
      125,
      340,
      398,
      559,
      577
    ],
    "summary": "The utilization of Vision Language Models (VLMs) in scientific visualization is currently quite limited. To address this, the developed workflow constructs temporal trajectories to map the evolution of flows under varying initial conditions, effectively capturing dynamic changes over time. This system integrates expert annotations with a VLM-based summarization pipeline to produce detailed and domain-specific reports. Through recurring discussions and observations of the workflow, key domain challenges were identified and distilled. The process involves collecting related images and annotations provided by experts to enhance the summarization pipeline. Within the system, Report View displays descriptive summaries for frames selected from a scatter plot, connecting visual clusters to semantic summaries. Preliminary tests suggest that this trajectory modeling can provide the groundwork for more advanced and expressive representational capabilities in scientific visualization tasks."
  },
  {
    "hex_coord": [
      -7,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      55,
      75
    ],
    "summary": "The applicability of Visual Language Models (VLMs) encounters significant challenges in domains that necessitate the use of domain-specific terminology and require high interpretive precision. These limitations often arise because VLMs, while adept at general image representation, may struggle to adequately handle specialized vocabularies and nuances essential for precise semantic interpretation in specific fields. Despite these constraints, image representation generated by VLMs can still be valuable for tasks such as clustering and semantic interpretation, providing a foundational layer upon which more domain-appropriate analytical techniques can build."
  },
  {
    "hex_coord": [
      -1,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      57,
      352
    ],
    "summary": "TemporalFlowViz is a specialized tool developed to facilitate expert-driven interpretation of scramjet combustion simulations. It provides users with the ability to subset and organize simulation data by utilizing a Filtering Panel, as illustrated in Figure 1(a1). This panel allows users to filter and cluster the data based on initial conditions and clustering parameters, enhancing the efficiency and precision of analysis in combustion research."
  },
  {
    "hex_coord": [
      -11,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      58,
      240,
      474,
      569
    ],
    "summary": "In this study, we employed a workflow that extracts high-dimensional embeddings from flow field images utilizing pretrained Vision Transformers (ViTs). Our investigation aimed to determine whether concentrating on specific regions, namely the isolator and cavity zones, could enhance the coherence of these embeddings. The automated descriptions generated were facilitated by the Gemma-3 Visual Language Model (VLM), which utilized nearest centroid descriptions and contextual images to inform the process. Furthermore, we identified that task-specific fine-tuning of the embeddings could potentially increase sensitivity to nuanced flow structures and transitional events, offering a more sophisticated understanding of the dynamics present in the flow fields."
  },
  {
    "hex_coord": [
      4,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      59,
      69,
      130,
      145,
      221
    ],
    "summary": "The paper introduces a five-stage backend workflow that utilizes dimensionality reduction and clustering techniques to identify latent combustion modes effectively. In response to Znamenskaya's survey, which highlights the importance of scalable and quantitative analysis tools, the workflow addresses the need for such methodologies. Furthermore, experts have underscored the necessity of visually clustering and summarizing combustion modes over time. Consequently, the study specifies system-level analytical requirements to guide the development of robust analysis and visualization tools for understanding combustion dynamics."
  },
  {
    "hex_coord": [
      5,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      62,
      103
    ],
    "summary": "The paper discusses an interactive multi-view interface designed to integrate various components of an analytical system. This interface facilitates coordinated filtering, trajectory exploration, case retrieval, and frame-level semantic inspection, enhancing the user's ability to interact with complex data. A subsequent step in the process involves retrieving relevant text templates, which are selected based on the detection of abnormalities within the dataset. This coordinated approach enables a comprehensive analysis by linking abnormal findings to contextually appropriate textual information."
  },
  {
    "hex_coord": [
      -3,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      64,
      151,
      310,
      332,
      339
    ],
    "summary": "Advancements in visualization techniques for flow fields are essential to effectively interpret complex, high-dimensional fluid dynamics data. One method to facilitate this interpretation is trajectory-based comparison, which aids in detecting stable states within the data. Dynamic Time Warping (DTW) is utilized to determine the optimal alignment path between two trajectories, denoted as $DTW(t_i, t_j)$, enabling a more nuanced comparison of fluid dynamics events. InternVL2.5, a model noted for its robust performance across vision-language benchmarks, enhances this workflow by retrieving the top-k nearest cluster centroids within a latent space, thereby improving the accuracy and efficiency of data analysis in these high-dimensional contexts."
  },
  {
    "hex_coord": [
      3,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      65,
      238,
      427
    ],
    "summary": "In the context of domain-specific applications, the FlowVisual framework developed by Wang et al. has been customized to enhance flow visualization for educational settings, aiming to facilitate a deeper understanding of complex phenomena. During iterative collaboration, experts E1 and E2 highlighted that critical combustion phenomena predominantly occur near the isolator and cavity regions within the scramjet configuration. This focus allowed for objective evaluation of the final implementation, ensuring that educational tools effectively communicated essential aspects of the scramjet's aerodynamic behavior."
  },
  {
    "hex_coord": [
      2,
      0
    ],
    "country": 0,
    "MSU_ids": [
      67,
      203
    ],
    "summary": "Znamenskaya's panoramic visualization survey conducts a comprehensive review of methods used for analyzing thermophysical flow fields. The paper details how each stage of these methods corresponds to specific analytical requirements, ensuring a structured approach to understanding and interpreting complex flow dynamics."
  },
  {
    "hex_coord": [
      0,
      0
    ],
    "country": 0,
    "MSU_ids": [
      68,
      300
    ],
    "summary": "Znamenskaya's survey comprehensively examines advanced techniques such as refractive index methods and digital particle image velocimetry. These methodologies are pivotal in analyzing fluid dynamics and combustion processes. When applied, they can reveal important patterns, such as trajectories that gradually converge or oscillate but remain confined, which are indicative of stable combustion modes. This suggests the survey's focus on leveraging precise measurement techniques to enhance the understanding of stability in combustion systems."
  },
  {
    "hex_coord": [
      -3,
      0
    ],
    "country": 0,
    "MSU_ids": [
      70,
      497
    ],
    "summary": "In the era of big data, He et al. introduced a parallel visualization framework specifically designed to handle large-scale flow-field data. This framework enables the effective encoding of localized combustion characteristics, capturing these details across temporal dimensions. By doing so, it facilitates a comprehensive understanding and analysis of complex flow phenomena in large datasets."
  },
  {
    "hex_coord": [
      -5,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      71,
      590
    ],
    "summary": "In the study conducted by He et al., a novel framework was introduced that effectively combines grid-segmented data partitioning with optimized communication strategies to enhance computational efficiency. The utility of this framework, named TemporalFlowViz, was rigorously demonstrated through two detailed expert-driven case studies. These case studies focused on the intricate dynamics of pressure and hydroxide (OH) fields, providing valuable insights into the practical applications of the proposed method in handling complex data sets."
  },
  {
    "hex_coord": [
      -6,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      72,
      205,
      252
    ],
    "summary": "He et al. have developed a framework that enables realtime interactivity with millions of grid cells. In this framework, each cropped flow field frame, denoted as $P'_i(t)$, is converted into a high-dimensional embedding vector, represented as $p_i(t)$. These frames, once encoded into high-dimensional embeddings, facilitate efficient and interactive processing of large-scale data."
  },
  {
    "hex_coord": [
      -1,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      73,
      344,
      388,
      414,
      558
    ],
    "summary": "The proposed system employs complementary approaches, such as saliency-guided importance sampling, to concentrate visualization efforts on dynamically significant regions. At the frame level, it generates direct semantic interpretations using nearby cluster exemplars. This methodology facilitates seamless multi-view inspection and enhances cross-case pattern recognition. By transforming latent trajectory structures into interpretable visual clusters, the system inherently utilizes semantic interpretation to provide valuable insights."
  },
  {
    "hex_coord": [
      -8,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      76,
      78,
      204,
      206,
      567
    ],
    "summary": "Early handcrafted methods like SIFT (Scale-Invariant Feature Transform) focus on extracting local keypoint descriptors, while techniques such as the Histogram of Oriented Gradients capture gradient orientations within localized cells. In a related context, simulation outputs are structured into time-sequenced flow field frames, which are further refined by applying user-specified initial conditions, including parameters like static pressure, temperature, and humidity. Enhancing these processes, pretrained Vision Transformers integrated into our pipeline are derived from general-purpose corpora, facilitating advanced feature extraction and analysis."
  },
  {
    "hex_coord": [
      -6,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      77,
      216,
      384,
      514
    ],
    "summary": "The paper discusses a method combining computer vision and language models to analyze image data. It utilizes the Scale-Invariant Feature Transform (SIFT) to detect distinctive image patches that remain consistent across transformations in scale and rotation. This invariant feature capture enables the identification of significant elements within an image. Expert annotations are then applied to the centroids of these representative clusters, facilitating the conditioning of a vision-language model on the data. This approach allows for the highlighting of target trajectories by contrasting them against a subdued background of other data points. Users are also provided the capability to inspect or generate frame descriptions for any selected embedding within the model, enhancing interpretability and interaction with the visual data."
  },
  {
    "hex_coord": [
      -10,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      79
    ],
    "summary": "The Histogram of Oriented Gradients (HOG) offers reliable structural features that enhance object recognition capabilities. By analyzing the orientation and intensity of gradients in localized portions of an image, HOG efficiently captures essential shape information. This method enables the extraction of invariant characteristics that contribute significantly to distinguishing different objects, proving its robustness in varying contexts within computer vision applications."
  },
  {
    "hex_coord": [
      -12,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      80
    ],
    "summary": "The emergence of deep convolutional neural networks (CNNs) represented a significant paradigm shift in the field of artificial intelligence and machine learning. This technological advancement fundamentally transformed the way complex data processing tasks were approached, facilitating breakthroughs in various domains such as image recognition, natural language processing, and autonomous systems. Through sophisticated hierarchical feature extraction capabilities, CNNs have enabled unprecedented levels of accuracy and efficiency, redefining industry standards and academic research methodologies in the analysis and interpretation of vast, multifaceted datasets."
  },
  {
    "hex_coord": [
      -11,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      81,
      209
    ],
    "summary": "In the paper, the authors explain how AlexNet signifies a breakthrough in the domain of image recognition by illustrating that end-to-end learning of hierarchical features significantly enhances the performance in large-scale image classification tasks. Additionally, they discuss a methodology for reducing frame-level embeddings, which contributes to optimizing the classification process by potentially improving computational efficiency and model scalability."
  },
  {
    "hex_coord": [
      -9,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      86,
      256
    ],
    "summary": "Vision Transformers utilize self-attention mechanisms to effectively capture long-range dependencies within visual data, enhancing their ability to understand complex relationships. In exploring the capabilities of Vision Transformers, the study tested several pretrained models, specifically BLIP2opt-2.7b, InternViT-6B-v2.5, and AIMv2-1B, each offering distinct architectural features and potential advantages in processing visual inputs within the scope of the research."
  },
  {
    "hex_coord": [
      -9,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      87,
      106,
      244,
      248,
      367
    ],
    "summary": "The paper discusses advancements in transformer models, particularly highlighting their state-of-the-art performance across various benchmarks, with a specific focus on Vision Transformers. Furthermore, it introduces the Graph Transformer, a novel implementation unit designed to dynamically transform high-level semantics in graph-structured data across multiple domains. The study employs a consistent embedding extraction pipeline for processing inputs, demonstrating a reduction in the average convergence radius r by 35.24 ± 0.59% when using PCA-reduced embeddings of cropped flow fields compared to un-cropped ones. This is evaluated through combustion simulations, where each point in the analysis represents a frame from these simulations, stressing the effectiveness of the transformation and embedding techniques in handling complex data structures."
  },
  {
    "hex_coord": [
      1,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      89,
      110,
      154,
      184,
      322,
      453,
      502,
      533
    ],
    "summary": "This research focuses on enhancing data clustering methods, particularly through the integration of Large Language Models (LLMs) with existing Computer-Aided Design (CAD) models. The objective is to harness LLMs' extensive medical domain knowledge and logical reasoning to complement the visual understanding capabilities of CAD systems. To facilitate communication, semantic annotation and report generation are employed. The study processes VTK data from physical fields using a Python program to generate images under a uniform colormap. Expert annotations are incorporated into a unified semantic pipeline, improving the precision of data interpretation. As depicted in Figure 5, the clustering process for pressure field frames from a ramjet engine leverages InternViT and DBSCAN algorithms. This approach produces scatter plots that display temporal trajectory views and similar trajectory views, alongside showcasing the geometric configurations of the scramjet engine. Notably, the analysis identifies the two most similar trajectories at specific locations, (s2) and (s3), highlighting potential areas for further investigation within the clustering framework."
  },
  {
    "hex_coord": [
      5,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      91,
      523
    ],
    "summary": "The paper discusses distance-based methods, including K-means and agglomerative clustering, which seek to identify relationships between data points using various distance metrics. In this context, Expert E4 emphasized the effective integration of trajectory views, spatial clustering, and multiframe comparison to enhance the analysis. This approach potentially improves the understanding of data patterns by leveraging the strengths of each technique in clustering and visual representation."
  },
  {
    "hex_coord": [
      -1,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      93,
      229,
      293,
      393
    ],
    "summary": "Connectivity-based methods offer a significant improvement over previous approaches by clustering data points that are highly interconnected. This approach is effectively utilized in translating complex simulation outputs into comprehensible textual reports. The study showcases this by presenting dimensionality reduction results through t-SNE, specifically for pressure and OH fields, in the top two scatter plots. Furthermore, a details view is provided, enabling experts to validate patterns derived from embeddings against actual flow fields, ensuring the accuracy and relevance of the simulations."
  },
  {
    "hex_coord": [
      3,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      96,
      207,
      218,
      383,
      472,
      488,
      549,
      553
    ],
    "summary": "Zhang et al. propose an LLM-driven framework for generating visualizations of circular genomes, which includes several features to enhance the user's analysis capabilities. The framework allows users to perform comparative analysis across selected cases through filtering and provides descriptive summaries of entire cases via a vision-language model. Each retrieved trajectory is depicted as a mini scatter plot, and users can save expert-written descriptions for specific clusters, such as cluster 0. The framework offers functionalities to toggle between frame- and trajectory-level summaries, facilitating efficient browsing and interpretation of various simulation outcomes. This approach significantly lowers the barrier to entry for less experienced analysts or interdisciplinary collaborators by enabling the production of interpretable narratives from latent structures. Additionally, experts can explore comparable cases swiftly with just one click, enhancing their analytical workflow."
  },
  {
    "hex_coord": [
      1,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      104,
      191,
      225,
      316,
      415,
      436,
      473,
      586
    ],
    "summary": "The study involved a comprehensive system designed to facilitate the interpretation of complex combustion simulations. The pipeline, which incorporates dimensionality reduction, was developed in collaboration with domain experts to meet specific analytical requirements. This system enables experts to explore simulations by generating automatic reports, where templates are paraphrased to produce final reports efficiently. The computed similarity scores within this framework serve two purposes: they aid in analysis and enhance understanding through detailed report generation. In one illustrative example, the system successfully provided an auto-generated description for the 12th frame of case (a), as seen in the bottom-left panel. Furthermore, experts have the capability to annotate representative cluster centroids, contributing to a more in-depth analysis and interpretation of the simulation data."
  },
  {
    "hex_coord": [
      -3,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      105,
      342,
      441
    ],
    "summary": "The central component of KERP is the Graph Transformer, which plays a pivotal role in processing data. In the workflow, Gemma-3 is utilized to produce descriptive summaries for the selected frame, providing essential insights and context. Once the weighted images are generated, they are further analyzed using TemporalFlowViz, which enables the visualization and interpretation of temporal data patterns. This integration of technologies enhances the overall analytic capabilities of the system."
  },
  {
    "hex_coord": [
      -4,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      107,
      195,
      255
    ],
    "summary": "Wang et al. present a novel framework that integrates large language models (LLMs) with computer-aided diagnosis (CAD) networks designed for medical imaging analysis. This framework incorporates TemporalFlowViz, which is responsible for two critical processes: preprocessing and embedding of the data. Within this architecture, the Vision Transformer (ViT) has been chosen as the encoder backbone, providing a robust basis for extracting and processing visual information essential for accurate diagnosis."
  },
  {
    "hex_coord": [
      -2,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      111,
      193,
      272,
      397,
      468
    ],
    "summary": "TemporalFlowViz is designed to enhance user-friendliness and interpretability for patients, offering improvements over conventional CAD systems. The workflow of the system begins with the preprocessing and embedding of flow field data, followed by an exploration of temporal trajectories. This allows experts to visually assess latent structures more efficiently. By employing expert-informed vision-language modeling, TemporalFlowViz facilitates the generation of comprehensive reports. The system's direct selection capability enables efficient inspection of critical frames. Additionally, InternViT-based clustering results demonstrate that trajectories related to stable scramjet combustion consistently form small, round clusters, as illustrated by circles in Figure 6, which underscores the precision and reliability of temporal analysis within the system."
  },
  {
    "hex_coord": [
      0,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      112,
      119
    ],
    "summary": "R2GenGPT is designed to utilize the pre-trained capabilities of large language models (LLMs), addressing their limitation in directly processing visual data. Meanwhile, researcher E1 is noted for their expertise in computational fluid dynamics and scramjet combustion modeling, potentially contributing to or benefiting from advancements in integrating visual data processing with LLMs."
  },
  {
    "hex_coord": [
      -2,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      113,
      190
    ],
    "summary": "The research paper discusses a model that aligns image features with large language models (LLMs) in order to generate radiology reports. This alignment allows the typically visually focused insights to be effectively integrated into clinical language, enabling frozen LLMs to produce comprehensive radiology documents. Additionally, the paper introduces TemporalFlowViz, a tool created to enhance the understanding of combustion evolution within scramjet simulations, focusing on parameter-aware interpretation. Together, these innovations provide advancements in both medical imaging and aerodynamics simulation by combining traditional methods with state-of-the-art computational models."
  },
  {
    "hex_coord": [
      -8,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      115,
      556
    ],
    "summary": "The system's approach effectively balances performance with efficiency, rendering it suitable for real-world medical applications. Additionally, experts have identified its scalability, making it capable of handling high-volume simulation settings efficiently."
  },
  {
    "hex_coord": [
      3,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      116,
      329
    ],
    "summary": "The study of scramjet combustion processes requires a comprehensive understanding of the intricate spatial and temporal patterns that emerge across various simulation runs. In the execution of workflows, domain experts play a crucial role by interactively assigning relevant combustion-specific terminology to chosen centroids. This annotation interface allows experts to accurately interpret and label the complex data generated during simulations, facilitating a deeper insight into the dynamic behaviors pertinent to scramjet combustion."
  },
  {
    "hex_coord": [
      -5,
      0
    ],
    "country": 0,
    "MSU_ids": [
      120,
      347
    ],
    "summary": "E1 possesses specialized knowledge in reactive flow structures and the transitions between different combustion modes. The research particularly emphasizes the importance of understanding key transitional events, such as flame stabilization and failure recovery, which are critical for effectively managing and optimizing combustion processes."
  },
  {
    "hex_coord": [
      -9,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      122,
      266
    ],
    "summary": "The study highlighted in the paper E2 centers on a simulation-based evaluation method designed to assess various engine configurations and their sensitivity to initial condition input parameters. This approach provides researchers with the flexibility to experiment with an array of embedding strategies tailored to the specific requirements of their analysis tasks. Through careful manipulation of simulation settings, the study facilitates a deeper understanding of engine performance under diverse conditions, thereby enhancing the robustness and applicability of the evaluation techniques used."
  },
  {
    "hex_coord": [
      4,
      -11
    ],
    "country": 0,
    "MSU_ids": [
      124,
      274,
      309,
      369,
      378,
      516
    ],
    "summary": "Over the past two years, we collaborated on a project focused on scramjet combustion simulation analysis. In this project, a visualization method was employed to enable experts to assess the continuity of temporal trajectories. These trajectories, represented as \\(p_i(\\cdot)\\) and \\(p_j(\\cdot)\\), were meticulously chosen through multiple expert reviews. When a specific case is selected, its frames are chronologically linked to construct a temporal trajectory, allowing for a coherent understanding of the sequence of events. Furthermore, the Similar Trajectories View facilitates the identification of the top six temporal trajectories that most closely resemble the currently selected case. A comprehensive case summary is also generated from the frames and their descriptions within each case, enhancing the clarity and insight into the data."
  },
  {
    "hex_coord": [
      5,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      126,
      219,
      409,
      498
    ],
    "summary": "The design of our visual analytics workflow and system was guided by a set of representative domain challenges, ensuring its relevance and effectiveness. The system aids in contextualizing visual observations through its outputs, providing deeper insights. The entire workflow is operationalized within an integrated environment, allowing seamless interaction and analysis. One of the key features, the Filtering Panel, enables users, such as E4, to dynamically adjust the ranges of initial conditions interactively, enhancing the analytical capability of the system."
  },
  {
    "hex_coord": [
      -4,
      3
    ],
    "country": 0,
    "MSU_ids": [
      131,
      179,
      257,
      450,
      506
    ],
    "summary": "The study aimed to evaluate the effectiveness of various Vision Transformer (ViT) architectures in capturing spatial features related to combustion processes, which are challenging to interpret due to their complex evolution. A key factor influencing combustion efficiency is the water vapor content, which affects how efficiently fuel is burned. Observations indicated that after 6 milliseconds, the pressure fields in regions a2, b2, and c2 became largely stable, indicative of steady-state combustion conditions. The combustion mode observed in the shear layer is distinguished by narrow, stratified flame structures that develop along the fuel–air interface, providing insights into the spatial dynamics of combustion phenomena."
  },
  {
    "hex_coord": [
      -2,
      2
    ],
    "country": 0,
    "MSU_ids": [
      132,
      301,
      434,
      507
    ],
    "summary": "Our analysis focuses on the assessment of combustion processes, particularly in determining whether combustion reaches a steady state. By examining latent-space trajectories, we explore how these trajectories indicate transitions between different combustion modes. Diverging trajectories, in particular, may signal the presence of unstabilized combustion modes. This investigation is exemplified in Fig. 8d(e), where the shear layer combustion mode is identifiable within circled regions, characterized by concentrated OH field intensity along a thin horizontal band. This reflects the complexity and dynamic nature of combustion transitions in varying operational states."
  },
  {
    "hex_coord": [
      1,
      1
    ],
    "country": 0,
    "MSU_ids": [
      133,
      152,
      429
    ],
    "summary": "The paper emphasizes the importance for experts to frequently evaluate whether combustion processes display oscillatory behaviors, as these patterns can be crucial for understanding transitional combustion dynamics. A trajectory-based comparison approach was utilized to bolster the interpretation of these transitional behaviors. This methodology was particularly highlighted in Case Study 1, which concentrated on the interpretation of combustion modes, demonstrating how trajectory analysis can effectively support the identification and understanding of oscillatory characteristics within combustion."
  },
  {
    "hex_coord": [
      -3,
      2
    ],
    "country": 0,
    "MSU_ids": [
      134,
      168
    ],
    "summary": "The assessment of transitional behaviors in combustion is a critical task for experts, as it involves determining changes in combustion dynamics. This process can be effectively analyzed through time series data, which tracks the progression of these dynamics from the initial ignition phase to an endpoint that may be either a stable combustion state or a shutdown caused by instability."
  },
  {
    "hex_coord": [
      -1,
      3
    ],
    "country": 0,
    "MSU_ids": [
      135,
      504
    ],
    "summary": "The study focused on evaluating ignition failure in combustion processes. The clustering analysis identified two distinct modes of combustion, providing insights into the conditions under which combustion might fail to ignite. This distinction is critical for experts who need to frequently assess and ensure reliable ignition in various applications."
  },
  {
    "hex_coord": [
      0,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      137,
      375,
      455
    ],
    "summary": "The paper discusses an approach to analyzing pressure field data, emphasizing the limitations of manual inspection due to its inherent subjectivity. To enhance objectivity and facilitate detailed analysis, the methodology employs dimensionality reduction techniques to project data onto a two-dimensional plane. This allows for the examination of spatial relationships between data points. Specifically, cropped pressure field frames are clustered using the DBSCAN algorithm to identify patterns within the data. The interface includes interactive features, where clicking on a point in the visualization highlights the corresponding frame in the Details View and initiates a semantic generation process in the Report View. This integrated approach aims to provide a more systematic and comprehensive analysis of pressure field data."
  },
  {
    "hex_coord": [
      -1,
      0
    ],
    "country": 0,
    "MSU_ids": [
      139,
      431
    ],
    "summary": "The classification of combustion modes, as explored in Case Study 2, was based on analyzing OH field trajectories. This approach often requires the interpretation of complex data, typically relying on the tacit knowledge of experts in the field. Such expertise enables the accurate discernment of different combustion modes, which is critical for understanding and optimizing combustion processes."
  },
  {
    "hex_coord": [
      1,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      140,
      355,
      396,
      403,
      410,
      546,
      573,
      600
    ],
    "summary": "The paper discusses a system designed to enhance team collaboration by addressing the lack of structured mechanisms for capturing and sharing expertise. It employs coordinated filtering techniques to manage information flow and reduce visual clutter in downstream views, making it easier for users to focus on relevant details. Hover previews facilitate efficient inspection of crucial frames, allowing users to quickly access important information. By using images and descriptions of selected frames, the system's Visual Language Model (VLM) generates comprehensive case summaries. These summaries, grounded in insights provided by human experts, create a shared semantic layer that aids in understanding and coordination. The implementation of provenance tracking in future iterations could further streamline the process, ultimately decreasing the workload on experts."
  },
  {
    "hex_coord": [
      2,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      142
    ],
    "summary": "The paper discusses the complexity involved in comparing cases that are driven by different parameters. It highlights the challenges that arise due to the intricate relationships between parameters, which can complicate direct comparisons and analyses. By addressing these complexities, the study aims to improve understanding and provide more robust frameworks for parameter-driven case analysis, offering insights into better managing and interpreting the outcomes of such comparisons."
  },
  {
    "hex_coord": [
      -10,
      2
    ],
    "country": 0,
    "MSU_ids": [
      143,
      163,
      521
    ],
    "summary": "The study focuses on design exploration within combustion systems by analyzing the impact of initial condition parameters on combustion outcomes. A specialized computational fluid dynamics (CFD) platform was utilized to generate the necessary dataset. This approach effectively allowed the system to differentiate between transient structural changes and genuine transitions in combustion modes, thereby enhancing the understanding of combustion dynamics."
  },
  {
    "hex_coord": [
      1,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      146,
      529
    ],
    "summary": "TemporalFlowViz was designed with system-level analytical requirements in mind, ensuring that it meets the needs for analyzing complex workflows. The evaluation sessions were focused on understanding expert perspectives concerning its capabilities and potential effectiveness in larger workflow generalizations and collaborative contexts. Through these sessions, insights were gathered regarding its adaptability and scalability in various professional environments, highlighting its utility in facilitating effective and comprehensive analysis."
  },
  {
    "hex_coord": [
      -6,
      2
    ],
    "country": 0,
    "MSU_ids": [
      147
    ],
    "summary": "The paper discusses a methodology for analyzing temporal flow field data by clustering it to identify underlying combustion modes. This approach involves reducing the dimensionality of the data to facilitate the detection of latent patterns and behaviors within complex combustion processes. By utilizing clustering techniques, the study aims to reveal hidden combustion dynamics that are not immediately apparent in the raw temporal data, thereby enhancing the understanding of combustion phenomena."
  },
  {
    "hex_coord": [
      -6,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      148
    ],
    "summary": "The paper focuses on the summarization of temporal flow field data to uncover evolution patterns over time. By applying dimensionality reduction techniques, the study effectively visualizes complex temporal dynamics within a two-dimensional framework. This approach allows for the clear identification of significant changes and progression trends within the data, facilitating a deeper understanding of how such flow fields evolve throughout the observed period. The methodology enhances interpretability and provides valuable insights into the temporal characteristics and transformation processes inherent in flow field datasets."
  },
  {
    "hex_coord": [
      3,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      149
    ],
    "summary": "The integration of trajectory-based visualization techniques enhances the ability to detect stable states within complex systems. By mapping the trajectories onto a reduced dimensional space, this approach allows for clear identification and analysis of patterns indicative of stability. Consequently, these visualizations provide critical insights that facilitate a deeper understanding of system dynamics and stability detection."
  },
  {
    "hex_coord": [
      3,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      150,
      461
    ],
    "summary": "The paper discusses the use of trajectory-based visualization as a tool for interpreting transitional combustion behaviors, specifically within the context of scramjet technology. The study examines scenarios where each case initiates with an unstable scramjet ignition. By visualizing the trajectories, researchers can gain insights into the combustion processes, facilitating a better understanding of the inherent instability during ignition and subsequent transitions. This approach aids in identifying patterns and improving the predictability of scramjet functionality under various operational conditions."
  },
  {
    "hex_coord": [
      1,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      153,
      562,
      593
    ],
    "summary": "TemporalFlowViz exemplifies the advancement in the field of visual analytics by incorporating expert insights into the interpretation of scientific simulations, particularly in the domain of combustion analysis. By seamlessly integrating semantic annotation with natural language report generation, it effectively bridges the gap between expert interpretations and accessible natural language outputs. This approach enhances usability for experts, enabling effective communication and understanding of complex temporal flow phenomena in scientific research. As a result, TemporalFlowViz marks a significant progression towards deeply integrated, expert-informed visualization tools that are essential for advancing scientific inquiry and communication."
  },
  {
    "hex_coord": [
      1,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      155,
      292
    ],
    "summary": "The paper discusses the use of semantic annotation and report generation as methods for automation, which streamline data processing and analysis. In the context of visualizing high-dimensional data, it evaluates dimensionality reduction techniques, specifically UMAP and t-SNE. The study finds that UMAP is more effective in preserving trajectory shapes and maintaining cluster separations in OH fields compared to t-SNE. This indicates that UMAP provides a more accurate and coherent representation of data structures, making it the preferred choice for applications requiring precise trajectory and cluster analysis."
  },
  {
    "hex_coord": [
      2,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      156,
      232,
      295
    ],
    "summary": "The study focuses on a parameter-aware case retrieval system that facilitates comparative exploration of trajectory data. By employing UMAP for dimensional reduction, the researchers can effectively compare projected trajectories using pressure field embeddings from cropped regions. The results indicate that UMAP offers superior preservation of trajectory shapes, especially in OH fields, when compared to t-SNE, highlighting its efficacy in maintaining the integrity of complex data structures during analysis."
  },
  {
    "hex_coord": [
      -10,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      157,
      303,
      313
    ],
    "summary": "The study undertakes a comparative exploration across various simulations characterized by distinct initial conditions, aiming to analyze the differences in outcomes effectively. To enhance the accuracy of these comparisons, the researchers iteratively refined a temporal dissimilarity metric, ensuring its reliability and precision. This refined metric preserves normalization through the consideration of local motion magnitudes, thereby facilitating an equitable assessment of temporal changes across different scenarios."
  },
  {
    "hex_coord": [
      0,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      160,
      321
    ],
    "summary": "In the study, a comprehensive dataset comprising scramjet combustion simulations was meticulously constructed. This dataset serves as the foundation for the integration of clustering techniques within a unified semantic pipeline, enhancing the analytical capabilities and facilitating a more coherent interpretation of the simulations. Through this integration, the research aims to offer a sophisticated approach to understanding and analyzing the complex dynamics inherent in scramjet combustion processes."
  },
  {
    "hex_coord": [
      4,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      161,
      478
    ],
    "summary": "The research utilizes a specifically constructed dataset designed to facilitate parameter-aware analysis tasks. This dataset plays a crucial role in the study's first case, which focuses on exploring Scramjet pressure fields. By leveraging the comprehensive data provided, the analysis aims to enhance understanding and support more advanced examinations within this particular domain."
  },
  {
    "hex_coord": [
      -7,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      162,
      235,
      243,
      368,
      440
    ],
    "summary": "The research presented in the paper involves a dataset that was generated in collaboration with domain experts, ensuring the data is both relevant and accurate. The study introduces TemporalFlowViz, a methodology that starts by preprocessing simulation outputs into multichannel flow field frames. To maintain consistency and comparability across the flow field channels, the size and location of the crop box were kept constant for all frames. In the subsequent analysis, data points were color-coded according to their cluster assignments, facilitating visual differentiation of clusters. The research further involved encoding the resulting weighted images into high-dimensional embeddings using advanced models such as Blip2-opt-2.7b, InternViT-6B-v2.5, and AIMv2-1B, which allow for sophisticated representation of complex data patterns."
  },
  {
    "hex_coord": [
      -4,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      165
    ],
    "summary": "The simulation campaign comprehensively explores scramjet combustion dynamics by analyzing over 200 individual cases. This extensive study provides detailed insights into the mechanisms underpinning scramjet engine performance and contributes to advancing our understanding of hypersonic propulsion systems."
  },
  {
    "hex_coord": [
      -1,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      166,
      264,
      405
    ],
    "summary": "The study investigates different scenarios, each characterized by a unique set of initial conditions. AIMv2, a model used within these scenarios, produced noisier data patterns and demonstrated a decrease in cluster coherence compared to previous iterations. However, by anchoring the model with expert-labeled centroids, the generated summaries were better aligned with combustion-specific terminology, ensuring that the outputs remained relevant and accurate to the domain of combustion studies."
  },
  {
    "hex_coord": [
      -11,
      2
    ],
    "country": 0,
    "MSU_ids": [
      167,
      173,
      449
    ],
    "summary": "In each simulation case, flow field data were recorded as a time series at regular intervals, enabling detailed analysis over time. The static pressure played a critical role in regulating the shock strength. As the simulation advanced, the surges observed in the flow dynamics either stabilized or displayed oscillatory behavior confined within a narrow region, indicating a nuanced interaction between pressure and flow stability."
  },
  {
    "hex_coord": [
      -3,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      170,
      242,
      290,
      333
    ],
    "summary": "In the study, each simulation case is characterized by a distinct combination of three initial condition parameters, allowing for a detailed exploration of combustion behavior. To effectively analyze these behaviors over time, latent-space trajectories are constructed for each case, capturing the dynamic evolution within the simulations. Two preprocessing strategies were compared to enhance the analysis: using entire flow field frames versus spatially cropping around the isolator and cavity region. Additionally, the deployment of InternVL2.5 presented several practical challenges, including high VRAM demands, limited support for quantization, and absence of pre-optimized formats, which impacted the efficiency and scalability of the process."
  },
  {
    "hex_coord": [
      -10,
      3
    ],
    "country": 0,
    "MSU_ids": [
      171,
      433
    ],
    "summary": "The study investigates the correlation between static pressure, ranging from 0.8 MPa to 2.1 MPa, and the transitions in combustion modes. By analyzing the evolution of the pressure field, insights were gained into how changes in pressure influence the shift between different combustion behaviors. This analysis provides a deeper understanding of the dynamic interplay between static pressure and combustion processes."
  },
  {
    "hex_coord": [
      -5,
      4
    ],
    "country": 0,
    "MSU_ids": [
      174
    ],
    "summary": "The study presents data on static temperature (T) within the range of 565 K to 830 K."
  },
  {
    "hex_coord": [
      -3,
      3
    ],
    "country": 0,
    "MSU_ids": [
      175,
      239,
      462,
      490,
      520
    ],
    "summary": "The study investigates the impact of static temperature on chemical reactivity within the context of combustion phenomena, emphasizing key processes such as ignition onset, shock-flame interaction, and stabilization. It was observed that regardless of spatial variations in the flame shape, the fundamental mode of combustion maintained stability, with each case transitioning to stable ramjet combustion within approximately 6 milliseconds. The OH field was utilized as a crucial indicator of combustion activity, providing insights into the dynamics and stability of the combustion process despite changes in spatial configuration."
  },
  {
    "hex_coord": [
      -7,
      4
    ],
    "country": 0,
    "MSU_ids": [
      176
    ],
    "summary": "The research investigates the influence of static temperature on ignition delay. The findings suggest that variations in static temperature significantly affect the ignition delay period, indicating its critical role in combustion processes. Understanding this relationship is essential for optimizing engine performance and efficiency."
  },
  {
    "hex_coord": [
      -10,
      4
    ],
    "country": 0,
    "MSU_ids": [
      177,
      326
    ],
    "summary": "In the study, the researchers observed that the water vapor content (H2O) in the system ranged from 7.8% to 14%. This variation in water vapor concentration corresponded to the formation of clusters that signify distinct latent combustion modes or transitional stages in the combustion process. These clusters provide insight into different phases that the system undergoes, highlighting the dynamic nature of combustion as influenced by water vapor content."
  },
  {
    "hex_coord": [
      -9,
      4
    ],
    "country": 0,
    "MSU_ids": [
      182,
      448,
      508,
      537
    ],
    "summary": "The study analyzes the behavior of pressure fields to understand the global flow evolution and determine the transition to steady or oscillatory combustion states. It is noted that surges occur well ahead of the cavity, suggesting behavior akin to a ramjet. Specifically, a distinct combustion mode, identified as the jet-wake mode, is characterized by a yellow cluster. In this mode, the flame develops a wide, curved tail that extends from the fuel inlet, highlighting unique combustion dynamics."
  },
  {
    "hex_coord": [
      -4,
      2
    ],
    "country": 0,
    "MSU_ids": [
      183,
      510
    ],
    "summary": "In the discussed study, the OH field is utilized to represent local combustion activity and the structural dynamics of flames. This is particularly relevant in understanding the characteristics of the jet-wake combustion mode, which is prominently illustrated in the circled portions of Figures 8a and 8b of the paper. These visualizations demonstrate the spatial distribution of combustion processes, highlighting the significant role of the OH field in interpreting the interactions within the combustion environment."
  },
  {
    "hex_coord": [
      -4,
      1
    ],
    "country": 0,
    "MSU_ids": [
      187
    ],
    "summary": "The dataset provides a robust foundation for analyzing combustion phenomena that are dependent on various parameters. By offering detailed insights into these phenomena, researchers can explore how different parameters influence combustion processes, facilitating a deeper understanding and potentially informing improvements in combustion efficiency and emissions control."
  },
  {
    "hex_coord": [
      -7,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      188,
      526
    ],
    "summary": "The study provides a comprehensive dataset that facilitates exploration across a diverse array of initial conditions, allowing for in-depth analysis and understanding of various scenarios. Additionally, the research included post-session interviews with domain experts, which offered valuable insights and feedback, enhancing the overall robustness and applicability of the findings."
  },
  {
    "hex_coord": [
      0,
      -10
    ],
    "country": 0,
    "MSU_ids": [
      194,
      234,
      278,
      412,
      572,
      595
    ],
    "summary": "TemporalFlowViz is designed to enhance the visualization of temporal data, specifically focusing on trajectory comparison. By using cropped inputs, the system provides clearer convergence of trajectories, thus allowing for more precise analysis. However, the use of t-SNE for dimensionality reduction can often lead to distortions in the global layout and trajectory geometry, presenting challenges in maintaining accuracy. To address scalability, future versions of TemporalFlowViz may integrate structured annotation templates. Additionally, two primary directions for future research have been identified: optimizing the visualization process and improving the accuracy of global layout representation."
  },
  {
    "hex_coord": [
      -4,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      197,
      202,
      270
    ],
    "summary": "TemporalFlowViz is a comprehensive framework designed to enhance the analysis of temporal data through expert-informed vision-language modeling. This framework consists of three main stages, each contributing to the efficacy of data processing and interpretation. A notable feature of TemporalFlowViz is its support for flexible plug-and-play utilisation of visual encoders, allowing users to easily integrate and customize various components according to their specific needs. This adaptability is complemented by the framework's capability to generate detailed reports, leveraging advanced vision-language models to provide insightful interpretations and analyses of temporal trends and patterns."
  },
  {
    "hex_coord": [
      -12,
      0
    ],
    "country": 0,
    "MSU_ids": [
      198,
      260,
      566,
      568,
      597
    ],
    "summary": "Recognition in this study is accomplished through deep feature embedding, utilizing pretrained Vision Transformers to effectively capture combustion-relevant features within pressure and OH fields. When comparing different models, it was observed that although they all reflect temporal evolution to some extent, there are significant differences in trajectory continuity, cluster separability, and interpretability of the latent structures they produce. To enhance clustering performance and ensure greater consistency across variable datasets, adaptive tuning strategies might prove beneficial. Consequently, improving the sensitivity of these embeddings could better reveal subtle physical structures like ignition fronts and weak flame zones."
  },
  {
    "hex_coord": [
      -6,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      208,
      299,
      552
    ],
    "summary": "The paper discusses a method for preprocessing and embedding flow field data, which serves to aid analysis tasks such as those outlined in R1 and R4. By using this approach, the resulting trajectory effectively visualizes the temporal evolution of flow characteristics. This allows experts to trace and understand the progression of phenomena such as ignition and stabilization within the embedding space, facilitating a deeper comprehension of dynamic flow behaviors."
  },
  {
    "hex_coord": [
      -8,
      0
    ],
    "country": 0,
    "MSU_ids": [
      210
    ],
    "summary": "The paper discusses a method where frame-level embeddings are clustered to uncover latent combustion states. This approach allows for the identification of hidden patterns within combustion processes, providing insights into the various underlying states through the analysis of these embeddings. By clustering these frame-level representations, the study effectively maps the complex dynamics of combustion into identifiable groups, enhancing the understanding of this intricate phenomenon."
  },
  {
    "hex_coord": [
      -3,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      213,
      330,
      437
    ],
    "summary": "The study introduces a Temporal Trajectory View, which enables experts to evaluate the steady-state convergence of systems. To facilitate this process, the research creates annotated exemplars that act as semantic anchors, aiding in guiding the generation process. Initially, the researchers focused on cropping the pressure field images to isolate the scramjet engine's core region, ensuring precise analysis and annotation."
  },
  {
    "hex_coord": [
      -13,
      0
    ],
    "country": 0,
    "MSU_ids": [
      224,
      379
    ],
    "summary": "The paper describes a pipeline that incorporates feature embedding as a crucial step. Within this framework, similarity between features is evaluated using a domain-informed difference metric, which enhances the accuracy by leveraging specific domain knowledge relevant to the dataset. This approach ensures that the measurement of similarity is both precise and contextually relevant, contributing to the effectiveness of the pipeline in handling complex data analyses."
  },
  {
    "hex_coord": [
      -2,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      233,
      268,
      320,
      400,
      401,
      411,
      491,
      548
    ],
    "summary": "The study explores the use of a vision-language model enhanced by a shared semantic layer, particularly effective in unfamiliar parameter regimes, to analyze preprocessed OH field images. These images were cropped to focus on the core scramjet engine region, generating more compact clusters in the embedding visualization process. The system employs InternViT to delineate mode transitions through clustering boundaries, facilitating the retrieval of top-k nearest cluster centroids for generating new frame descriptions. This retrieval mechanism enables experts to extrapolate observations from one case to others with similar dynamics, leveraging annotated descriptions as contextual input for improved analysis and interpretation."
  },
  {
    "hex_coord": [
      -9,
      1
    ],
    "country": 0,
    "MSU_ids": [
      241
    ],
    "summary": "The research investigated the potential benefits of concentrating on the isolator and cavity zones within a system to enhance the interpretability of downstream processes. By examining these specific zones, the study aimed to determine if such a targeted focus could lead to improved insights and understanding of subsequent operations and results."
  },
  {
    "hex_coord": [
      5,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      259
    ],
    "summary": "To analyze the latent structures within the data, we employed a dimensionality reduction method for visualization purposes. This approach allowed us to effectively reduce the complexity of the data while preserving its essential features, enabling us to display the latent distributions in a comprehensible two-dimensional space. This visualization facilitated a clearer understanding of the underlying patterns and relationships present within the dataset."
  },
  {
    "hex_coord": [
      -8,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      261
    ],
    "summary": "BLIP-2 was designed to produce smooth and temporally ordered embeddings, indicating its capability to generate vector representations that maintain coherence and sequencing over time. This characteristic is crucial in ensuring that the embeddings reflect a consistent progression, facilitating applications where temporal dynamics and continuity are essential."
  },
  {
    "hex_coord": [
      -1,
      2
    ],
    "country": 0,
    "MSU_ids": [
      262,
      539
    ],
    "summary": "In the study presented within the BLIP-2 framework, it was observed that numerous combustion sequences formed U-shaped manifolds, signaling a progressive evolution in the combustion process. This configuration allowed the system to effectively distinguish and categorize various combustion behaviors, maintaining its analytical capabilities even when faced with fluctuations in OH field trajectories at steady state. Such an approach highlights the robustness of the system in capturing the dynamic characteristics of combustion through dimensional reduction."
  },
  {
    "hex_coord": [
      -8,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      263,
      289,
      311,
      346,
      442,
      443
    ],
    "summary": "In the study, the analysis of ViT-based embeddings, including InternViT, revealed a consistent configuration where embeddings from various backbone models could be examined under a unified projection basis. Using Dynamic Time Warping, the Temporal Trajectory View enabled flexible temporal matching and highlighted a common structure across all tested embeddings. Initially, the temporal trajectories were dispersed, but over time, they converged into a compact cluster, indicating clearer chronological transitions. This convergence facilitated the production of focused summaries to elucidate key transitional events, despite InternViT initially producing multiple fragmented clusters with less distinct transitions."
  },
  {
    "hex_coord": [
      -6,
      1
    ],
    "country": 0,
    "MSU_ids": [
      265
    ],
    "summary": "In our system, we consider all three Vision Transformer (ViT) backbones as viable options. This retention ensures that we leverage the unique strengths of each architecture, providing flexibility and adaptability in various applications where visual processing is required. By keeping all three structures at our disposal, we can optimize the system's performance across diverse tasks, benefiting from the distinctive features and capabilities inherent in each ViT backbone."
  },
  {
    "hex_coord": [
      1,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      267,
      417,
      560
    ],
    "summary": "The paper discusses the application of BLIP-2 for trajectory-based reasoning within complex combustion simulations. This system facilitates experts in conducting detailed reports by transitioning from raw image data to hypothesis-driven analysis much more rapidly. By enabling these capabilities, BLIP-2 significantly accelerates the analytical processes for domain specialists, enhancing their ability to interpret and understand intricate simulation outcomes efficiently."
  },
  {
    "hex_coord": [
      4,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      271,
      365,
      457
    ],
    "summary": "TemporalFlowViz employs a robust analysis pipeline that ensures consistency throughout the visualization process. Within this framework, the Temporal Trajectory View plays a critical role by visualizing high-dimensional frame embeddings that have been projected into a two-dimensional space through dimensionality reduction techniques. The effectiveness of this approach is exemplified in the Similar Trajectory View, where trajectories such as (b1) and (c1) are identified as the two most similar paths, showcasing the capability of the system to discern and represent intricate temporal relationships within complex datasets."
  },
  {
    "hex_coord": [
      -1,
      1
    ],
    "country": 0,
    "MSU_ids": [
      273,
      483
    ],
    "summary": "The dimensionality reduction projection facilitates experts in visually evaluating the separation of different combustion modes. In this analysis, clusters labeled (a) to (d) specifically corresponded to the scramjet combustion mode, allowing for a clear identification and differentiation from other potential modes. This visual assessment aids in better understanding the dynamics of combustion in scramjet applications."
  },
  {
    "hex_coord": [
      -5,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      275
    ],
    "summary": "The paragraph discusses the results of dimensionality reduction using t-SNE, specifically focusing on the pressure and OH field embeddings. The projection results are illustrated in the top two plots, providing a visualization of how these high-dimensional data are represented in a two-dimensional space. This technique helps to reveal the underlying structure and relationships within the data by positioning those with similar embeddings closer together in the reduced dimension."
  },
  {
    "hex_coord": [
      4,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      281,
      337,
      464
    ],
    "summary": "In our study, we conducted a detailed analysis on stable scramjet combustion, specifically focusing on case (a). To effectively visualize and interpret the results, we employed a batch-oriented visual analytics workflow where Gemma-3 was identified as a more suitable tool. Additionally, using UMAP, we were able to better preserve the combustion trajectory shapes in the two-dimensional layout, enhancing our ability to understand and analyze the combustion processes."
  },
  {
    "hex_coord": [
      -2,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      283,
      458
    ],
    "summary": "UMAP is noted for its superior ability to preserve transition trends within data. In the context of the study, specific flow field frames labeled as (a2), (b2), and (c2) correspond respectively to the cases represented by (a1), (b1), and (c1). Through this approach, UMAP effectively captures and maintains the essential patterns and transitions present in the flow fields, underscoring its efficacy in dimensionality reduction tasks applied to complex datasets."
  },
  {
    "hex_coord": [
      3,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      284
    ],
    "summary": "Based on a comprehensive visual evaluation and expert feedback, UMAP was chosen as the default projection method for Optimal Hyperplane (OH) fields. This decision underscores the method's effectiveness and reliability in accurately rendering data patterns, which facilitates enhanced data interpretation and analysis in two-dimensional space."
  },
  {
    "hex_coord": [
      5,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      285,
      395,
      425,
      456,
      554
    ],
    "summary": "UMAP facilitates the construction of more accurate temporal trajectories, enhancing the analysis of data over time. The Details View is instrumental in this process, as it allows experts to visually confirm the structure of these latent trajectories. In a study to assess the efficacy of this approach, two additional experts, referred to as E3 and E4, were invited to perform independent analyses. Their evaluations were supported by a scatter plot, specifically scatter plot (a1), which presented the clustering result in the Temporal Trajectory View. Several experts involved in the study noted that these visual tools were particularly useful in validating existing hypotheses, underscoring the utility of UMAP and its visualization techniques in complex data analysis."
  },
  {
    "hex_coord": [
      -3,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      287,
      288
    ],
    "summary": "In this study, the UMAP parameters were set to \\(n\\_neighbors = 15\\) and \\(min\\_dist = 0.1\\). These specific values were selected based on recommended values from previous research as well as through empirical tuning to achieve optimal results in the dimensionality reduction process."
  },
  {
    "hex_coord": [
      -1,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      296
    ],
    "summary": "The study indicates that UMAP demonstrates superior capability in maintaining cluster separations within OH fields, contrasting with the performance of t-SNE. This suggests that UMAP is more effective in preserving the structural integrity of data clusters during dimensionality reduction, offering a more accurate representation of the original data's spatial relationships. Consequently, for applications requiring precise cluster delineation, UMAP may be the preferred method over t-SNE."
  },
  {
    "hex_coord": [
      -3,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      297,
      334,
      492
    ],
    "summary": "In the study, UMAP was utilized to project frame embeddings, resulting in representations denoted as $p'_i(1)$, $p'_i(2)$, ..., $p'_i(t_i)$, which facilitate a more effective analysis in the two-dimensional space. Concurrently, the implementation of Gemma-3 allowed for efficient data processing through the use of lightweight 4-bit and 8-bit quantizations. Moreover, preprocessing techniques were employed to eliminate irrelevant background areas, thereby enhancing the clarity and precision of the data analysis. Together, these methodologies contribute to a streamlined and robust approach for handling complex datasets."
  },
  {
    "hex_coord": [
      -12,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      302,
      304,
      314,
      362,
      596
    ],
    "summary": "In collaboration with domain experts, we have developed a temporal dissimilarity metric that facilitates elastic alignment, enhancing the analysis of complex data sequences. This innovative metric enables users to choose the specific flow field component for generating feature embeddings, thereby offering flexibility in the examination of data characteristics. Moreover, we intend to advance this research by constructing a domain-adaptive Vision Transformer, which will be fine-tuned using extensive combustion simulation datasets, to further refine the application and efficacy of the metric within its targeted domain."
  },
  {
    "hex_coord": [
      0,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      306,
      459
    ],
    "summary": "The study involved experts who assessed various formulations to determine their effectiveness in capturing physically meaningful similarities. A key aspect of these evaluations was focused on the geometric configurations of the scramjet engine used in the simulations. This analysis was crucial for understanding and accurately modeling the complex interactions within the engine's design."
  },
  {
    "hex_coord": [
      -5,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      323
    ],
    "summary": "The paper presents a novel approach by integrating vision-language modeling into a unified semantic pipeline. This integration aims to enhance the understanding and processing of visual and linguistic data, enabling the system to effectively manage and interpret multimodal information within a singular, consistent framework."
  },
  {
    "hex_coord": [
      -8,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      327
    ],
    "summary": "To accurately represent each cluster within our analysis, we determine a representative centroid for each cluster $C_k$. This is achieved by selecting the embedding that is nearest to the mean of the cluster, thus ensuring the most precise depiction of the cluster’s central tendency within the reduced-dimensional space."
  },
  {
    "hex_coord": [
      0,
      -8
    ],
    "country": 0,
    "MSU_ids": [
      328,
      351,
      480
    ],
    "summary": "The system presented in the paper provides a comprehensive framework that facilitates expert annotation by utilizing centroids as a foundational element. It enables experts to seamlessly transition between various analytical processes, such as parameter-level filtering, inspecting latent structures, validating raw data fields, and conducting detailed case-level reporting. Additionally, the temporal trajectory can be zoomed into specific areas, such as denoted by (a1), allowing for in-depth analysis and inspection of data over time. This integrated approach enhances the efficiency and accuracy of expert evaluations and annotations."
  },
  {
    "hex_coord": [
      -4,
      -4
    ],
    "country": 0,
    "MSU_ids": [
      331,
      416,
      570
    ],
    "summary": "In this study, we evaluated the efficacy of two open-source Vision-Language Models (VLMs) - InternVL2.5-38B and Gemma-3-27B - in the context of interpreting complex combustion simulations. The system we developed facilitates the analysis of these simulations, allowing experts to gain valuable insights. A key component of this process involves the annotation of cluster centroids by experts, which has been shown to be effective in anchoring semantic generation, thereby enhancing the interpretation capabilities of the VLMs."
  },
  {
    "hex_coord": [
      -9,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      335,
      336
    ],
    "summary": "Gemma-3 demonstrates effective performance in the domain of image-to-text conversion, distinguishing itself by providing efficient generation speeds. Notably, it is capable of processing multiple images simultaneously in a single pass, while maintaining operations without encountering out-of-memory issues. This capability underscores its robustness and efficiency in handling complex tasks and vast amounts of data."
  },
  {
    "hex_coord": [
      -3,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      338
    ],
    "summary": "In the deployment of our workflow, the integration of Gemma-3 plays a crucial role. As a key component, Gemma-3 enhances our system's efficiency by streamlining processes and improving overall functionality. This adoption underscores our commitment to implementing advanced solutions that optimize performance and adaptability within our operations."
  },
  {
    "hex_coord": [
      -5,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      343
    ],
    "summary": "The mechanism described in the paper is designed to support multiple levels of semantic abstraction. Through its architecture, it facilitates the representation and processing of complex information by allowing for the abstraction of semantics at various levels. This enables the system to handle intricate tasks that require a nuanced understanding and manipulation of data, potentially enhancing its performance in diverse applications."
  },
  {
    "hex_coord": [
      -4,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      345,
      399,
      469,
      470,
      598
    ],
    "summary": "In our study, we employ Gemma-3 to aggregate information along latent trajectories, thereby generating comprehensive case-level overviews for entire simulation cases. These overviews include descriptions that may either be generated by a Vision-Language Model (VLM) or manually annotated, enhancing the depth of analysis. Notably, ramjet cases often originate from specific clusters and subsequently terminate in larger, more stable clusters, exemplified by cluster (e). To ensure accuracy and relevance in our cluster labeling, we collaborated with expert E3 for the manual annotation of representative cluster centroids. Our ultimate goal is to develop a multimodal annotation workflow powered by large vision-language models, optimizing the efficiency and precision of our analysis."
  },
  {
    "hex_coord": [
      4,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      349
    ],
    "summary": "The TemporalFlowViz workflow comprises several key stages: initially, data filtering is performed to refine the input dataset, ensuring quality and relevance. This is followed by embedding projection, which transforms the high-dimensional data into a lower-dimensional space for easier visualization and analysis. As the process progresses, trajectory construction is employed to visualize the dynamics and temporal patterns within the data, making them accessible and interpretable. Subsequently, similarity retrieval is used to identify and analyze patterns or behaviors that resemble each other. Finally, semantic interpretation is applied to derive meaningful insights and conclusions from the visualized trajectories, leading to a comprehensive understanding of the temporal flow within the dataset."
  },
  {
    "hex_coord": [
      5,
      -7
    ],
    "country": 0,
    "MSU_ids": [
      350,
      371
    ],
    "summary": "The paper discusses a perspective that facilitates multilevel visual reasoning, enabling analysis at various levels. This approach suggests that the visual system can interpret and synthesize information across different scales, enhancing the depth and clarity of analysis."
  },
  {
    "hex_coord": [
      -8,
      2
    ],
    "country": 0,
    "MSU_ids": [
      353
    ],
    "summary": "The Initial Parameter Filters section of the study offers a set of interactive tools, including sliders and text boxes, designed to refine the simulation dataset. These tools allow researchers to constrain the dataset based on key parameters such as static pressure, expressed in MPa, static temperature, measured in Kelvin, and water vapor concentration, indicated as a percentage of $H_2O$. These features enable precise control and customization, facilitating a more targeted analysis of the simulation conditions."
  },
  {
    "hex_coord": [
      -2,
      3
    ],
    "country": 0,
    "MSU_ids": [
      354,
      555
    ],
    "summary": "The use of these filters enables users to focus on specific combustion modes, such as high-pressure lean combustion, by isolating them from other modes. This capability has led to significant findings, as multiple experts have reported that these filters facilitated the discovery of unexpected cases displaying hybrid combustion characteristics. Such discoveries highlight the utility of comprehensive filtering in advancing the understanding of complex combustion behaviors."
  },
  {
    "hex_coord": [
      -1,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      360,
      477,
      531
    ],
    "summary": "The study explores the use of the DBSCAN clustering algorithm, which can be customized through various parameters, to analyze pressure fields within scramjet combustion modes. A case study is presented, demonstrating the clustering of OH field trajectories to identify distinct combustion modes, specifically focusing on scramjet and ramjet modes. Visual representations and comparisons of temporal trajectories within clusters are provided, emphasizing the differentiation of shear layer and jet-wake combustion modes."
  },
  {
    "hex_coord": [
      5,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      366,
      392,
      407
    ],
    "summary": "Dimensionality reduction in the study is conducted utilizing techniques like UMAP. This process facilitates users to examine a comprehensive description of the data in the Report View. The Report View is designed to support the efficient review, editing, and exporting of findings, enabling seamless documentation and fostering collaborative discussions among experts."
  },
  {
    "hex_coord": [
      -5,
      2
    ],
    "country": 0,
    "MSU_ids": [
      370
    ],
    "summary": "The study focuses on understanding the evolution of combustion dynamics by analyzing their temporal trajectory in a latent space. This approach allows for the detailed observation of changes and developments in the dynamics over time, providing insights into the underlying processes governing combustion behavior. By mapping these dynamics into a latent space, the study reveals the patterns and pathways they follow as they evolve, offering a deeper understanding of combustion mechanisms."
  },
  {
    "hex_coord": [
      -7,
      3
    ],
    "country": 0,
    "MSU_ids": [
      372,
      430,
      438
    ],
    "summary": "In a global analysis, experts are able to identify clusters that correspond to different combustion modes. This analysis was highlighted in Case Study 1, which was conducted by E3, a postdoctoral researcher with specialization in reactive flow diagnostics. The study particularly focused on examining the isolator and cavity areas."
  },
  {
    "hex_coord": [
      -13,
      1
    ],
    "country": 0,
    "MSU_ids": [
      380
    ],
    "summary": "The domain-informed difference metric is designed to emphasize the relative deviation particularly near the final time steps of each trajectory. This focus allows for a more precise assessment of trajectory variations, which is crucial for accurately understanding the dynamics of the system under study. By highlighting the deviations at these critical junctures, the metric provides insights into how outcomes may differ based on initial conditions or perturbations throughout the trajectory, thus improving the reliability of predictions concerning system behavior over time."
  },
  {
    "hex_coord": [
      -9,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      381
    ],
    "summary": "The design of the study emphasizes the importance of convergence and stability characteristics, ensuring that the system maintains consistent and reliable performance. By focusing on these aspects, the authors aim to enhance the overall effectiveness of the design in practical applications, facilitating optimal functionality and adaptability within various operational contexts."
  },
  {
    "hex_coord": [
      -6,
      3
    ],
    "country": 0,
    "MSU_ids": [
      382
    ],
    "summary": "The interpretation of combustion behavior necessitates a focused assessment of convergence and stability characteristics. These parameters are essential in determining the reliability and predictability of combustion processes. Understanding convergence ensures that the computational models accurately reflect the real-world phenomena by producing consistent results, while stability characteristics guarantee that the systems respond appropriately under varying conditions. Together, these elements are instrumental in advancing our comprehension of combustion dynamics and optimizing related technologies."
  },
  {
    "hex_coord": [
      -2,
      1
    ],
    "country": 0,
    "MSU_ids": [
      394
    ],
    "summary": "The paper discusses the functionality of the details view in enabling experts to pinpoint crucial occurrences within a dataset, specifically focusing on events like ignition or blowout. This capability is essential for the analysis and interpretation of complex data, as it provides a clear visual representation that aids professionals in accurately identifying and understanding critical events within the studied phenomena. Through this method, experts can conduct a more thorough investigation, thereby enhancing the assessment and decision-making processes related to the events being analyzed."
  },
  {
    "hex_coord": [
      -7,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      413,
      465
    ],
    "summary": "The study presents a system that utilizes raw flow inspection to analyze data. During the simulation, the observed trajectory consistently maintained its position within a tightly clustered area, indicating stable behavior and potentially reliable results from the inspection process. This suggests that the system effectively captures and monitors flow dynamics, ensuring that the trajectories are concentrated and exhibit minimal variation over the simulation period."
  },
  {
    "hex_coord": [
      -1,
      -9
    ],
    "country": 0,
    "MSU_ids": [
      418,
      587
    ],
    "summary": "The system described in the paper achieves high precision and interactivity by using annotated cluster centroids to condition a vision-language model. This approach facilitates the generation of detailed frame- and case-level descriptions, enhancing the model’s ability to accurately interpret and convey visual and linguistic information in an integrated manner."
  },
  {
    "hex_coord": [
      5,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      426,
      582
    ],
    "summary": "The study utilized a deployed system for the analyses, which facilitates interpretable, expert-guided visual examination of combustion simulation data. This system enhances the understanding of complex simulation outputs by providing a structured approach, allowing experts to visualize and interpret the data effectively in a two-dimensional representation."
  },
  {
    "hex_coord": [
      2,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      432
    ],
    "summary": "In Case Study 2, a detailed assessment was carried out by E4, who is a senior simulation engineer specializing in the evaluation of engine configurations. This investigation focused on understanding and analyzing various aspects of engine design, leveraging E4's expertise to provide comprehensive insights into the performance metrics and configurations. The study aimed to contribute valuable knowledge to the field of engine simulation and design optimization."
  },
  {
    "hex_coord": [
      -5,
      3
    ],
    "country": 0,
    "MSU_ids": [
      439,
      575,
      591
    ],
    "summary": "In our research, we focused on steady and quasi-steady combustion within various subregions, assigning larger weights to those areas exhibiting pronounced combustion activity. Through detailed case studies, we demonstrated the system's capacity to effectively distinguish between different combustion modes and uncover the evolution patterns inherent in these processes. Furthermore, our findings support scalable interpretations across parameterized simulations, highlighting the system's robustness and applicability to diverse combustion scenarios."
  },
  {
    "hex_coord": [
      -6,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      444,
      565
    ],
    "summary": "In our study, we employed InternViT as a means to extract high-quality embeddings from the frame data, which enabled us to effectively display the clustering results in a two-dimensional layout. This approach facilitated a more intuitive visualization of the data's inherent structure. Additionally, by manually selecting specific parameters, we achieved fine control over the embedding extraction process, ensuring that the clustering results were optimally represented for analysis purposes."
  },
  {
    "hex_coord": [
      -7,
      2
    ],
    "country": 0,
    "MSU_ids": [
      447,
      467
    ],
    "summary": "The study identified a distinct blue-red interface, which highlighted a pronounced pressure surge occurring consistently between the isolator and cavity. These pressure surges were notably stable and stationary, suggesting a reliable and continuous scramjet operation. This phenomenon underscores the interface's critical role in maintaining efficient performance in scramjet systems."
  },
  {
    "hex_coord": [
      -5,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      452
    ],
    "summary": "The study undertakes a comparative analysis between the Temporal Trajectory View and the Similar Trajectories View, revealing that cases with analogous trajectory shapes demonstrate a consistent evolution in their pressure fields. This finding underscores the reliability of the Similar Trajectories View in ensuring that comparable trajectory patterns align closely with the pressure field dynamics over time. Consequently, the research provides robust evidence supporting the linkage between trajectory shape similarity and pressure field evolution, facilitating enhanced understanding of fluid dynamics in varied scenarios."
  },
  {
    "hex_coord": [
      1,
      2
    ],
    "country": 0,
    "MSU_ids": [
      460
    ],
    "summary": "The study illustrated in Fig. 5 demonstrates that cases (a1) to (c1) exhibit remarkably similar combustion pathways. These cases, despite potentially differing initial conditions or configurations, converge on analogous processes and stages throughout combustion. Such findings indicate a consistent underlying mechanism driving the combustion behavior across these scenarios, suggesting that the combustion pathways are governed by fundamental principles that remain constant, irrespective of the surface-level changes. This insight could be instrumental in optimizing combustion systems by focusing on these invariant pathways."
  },
  {
    "hex_coord": [
      2,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      463,
      538
    ],
    "summary": "The study effectively utilized latent trajectory analysis to understand dynamic combustion behavior. Through this method, the system successfully separated and characterized various combustion behaviors across different cases, demonstrating the efficacy of clustering results in analyzing complex combustion dynamics."
  },
  {
    "hex_coord": [
      3,
      -3
    ],
    "country": 0,
    "MSU_ids": [
      471
    ],
    "summary": "The study aimed to assess the capability of semantic reporting."
  },
  {
    "hex_coord": [
      -4,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      484
    ],
    "summary": "The larger cluster of points surrounding (e) indicates a predominant ramjet combustion mode. This suggests that the data within this cluster share characteristics consistent with the operational and performance metrics typical of ramjet engines, which rely on the combustion of air and fuel within a specifically designed duct. This clustering may represent specific conditions or parameters influential to the ramjet's ability to function efficiently, reflecting its adaptation to high-speed flight environments where ramjet engines are commonly utilized."
  },
  {
    "hex_coord": [
      -9,
      2
    ],
    "country": 0,
    "MSU_ids": [
      494
    ],
    "summary": "The upper region of the engine displayed significant variations in the OH field, indicating the presence of more complex and informative flame structures in comparison to other regions. This suggests that the upper section plays a crucial role in influencing the combustion characteristics within the engine, possibly affecting overall performance and efficiency. By understanding these intricate flame patterns and their interactions, advancements can be made in optimizing engine design and operation."
  },
  {
    "hex_coord": [
      -7,
      0
    ],
    "country": 0,
    "MSU_ids": [
      499
    ],
    "summary": "In this study, the researchers focused on optimizing the DB-SCAN clustering algorithm by adjusting its parameters, specifically the epsilon (ε) and minSamples. These modifications were crucial for refining the clustering results, ensuring that the algorithm more accurately identified the underlying structure of the data in a two-dimensional plane following dimensionality reduction. By fine-tuning these parameters, the study aimed to enhance the effectiveness and precision of clusters formed in the analysis."
  },
  {
    "hex_coord": [
      0,
      1
    ],
    "country": 0,
    "MSU_ids": [
      505
    ],
    "summary": "In the study, the analysis of the scatter plot revealed that the red cluster was indicative of the shear layer combustion mode. This mode is characterized by its distinct placement within the two-dimensional plane, emphasizing the impact of shear layers in the combustion process. Through the application of dimensionality reduction techniques, the researchers were able to identify and visually segregate this specific combustion mode, illustrating the method's effectiveness in distinguishing complex combustion phenomena."
  },
  {
    "hex_coord": [
      -10,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      518
    ],
    "summary": "In the study, it was observed that despite the pressure field of a simulation achieving a steady state, the trajectory of the OH field can continue to exhibit fluctuations within a relatively expansive region of the embedding space. This indicates that while the pressure field may stabilize, other dynamic components, such as the OH field, can still experience variability, highlighting the complexity and ongoing dynamics in the system's behavior even after reaching what seems to be equilibrium in certain state variables."
  },
  {
    "hex_coord": [
      4,
      -1
    ],
    "country": 0,
    "MSU_ids": [
      524
    ],
    "summary": "The integration of trajectory views, spatial clustering, and multiframe comparison facilitated the swift identification of representative combustion modes. This approach allowed researchers to efficiently analyze and distinguish various combustion characteristics by visualizing and clustering data trajectories. The method proved effective in categorizing and understanding the complexities inherent in combustion processes, ultimately enhancing the ability to identify significant patterns and modes more rapidly and accurately."
  },
  {
    "hex_coord": [
      -2,
      -6
    ],
    "country": 0,
    "MSU_ids": [
      530
    ],
    "summary": "The expert reflections identified several critical insights. Firstly, they emphasized the significance of integrating interdisciplinary approaches to solve complex problems, highlighting that collaborative efforts across various fields can lead to more innovative solutions. Furthermore, the experts underscored the importance of continuous learning and adaptation in rapidly changing environments, suggesting that professionals must remain open to new ideas and technologies to maintain competitiveness. Additionally, the reflections pointed out the necessity of ethical considerations in research and development, stressing that advancements should align with societal values to ensure they are beneficial and sustainable in the long term. Overall, these insights collectively call for a holistic, adaptive, and ethical approach in contemporary scientific and technological pursuits."
  },
  {
    "hex_coord": [
      0,
      3
    ],
    "country": 0,
    "MSU_ids": [
      535
    ],
    "summary": "The study identified two distinct combustion modes, highlighting the complexity and variation present in the combustion processes analyzed. This discovery offers insight into the underlying mechanisms that differentiate these modes and provides a foundation for further exploration into optimizing combustion efficiency and reducing emissions. The identification and understanding of these modes are crucial for advancing combustion technology and improving overall performance in relevant applications."
  },
  {
    "hex_coord": [
      -5,
      1
    ],
    "country": 0,
    "MSU_ids": [
      536
    ],
    "summary": "The red cluster represents the shear layer combustion mode, which is distinguished by narrow, stratified flame structures situated along the fuel–air interface."
  },
  {
    "hex_coord": [
      -9,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      541
    ],
    "summary": "In the discussed research, centroids are identified as pivotal elements that can be annotated and subsequently reused in various simulation scenarios. This capability enhances the efficiency and consistency of simulation analyses, allowing researchers to maintain a uniform reference point across different experimental setups. By annotating centroids, researchers can enrich the data with meaningful insights, leading to more robust conclusions and facilitating the comparison and replication of simulation results."
  },
  {
    "hex_coord": [
      -2,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      544
    ],
    "summary": "The research highlights the significance of semantic report generation, emphasizing its utility as an essential interpretive tool. This process aids in understanding complex datasets by transforming them into coherent reports that facilitate better interpretation and analysis. Through semantic enhancement, the generated reports offer deeper insights, providing a more accessible and informative representation of data for researchers and analysts."
  },
  {
    "hex_coord": [
      -6,
      0
    ],
    "country": 0,
    "MSU_ids": [
      561
    ],
    "summary": "TemporalFlowViz excels in various tasks related to interpreting combustion phenomena, showcasing its robust performance and effectiveness in this specialized field."
  },
  {
    "hex_coord": [
      -10,
      -5
    ],
    "country": 0,
    "MSU_ids": [
      576
    ],
    "summary": "The system is engineered to effectively generalize across both unsteady and transient events, demonstrating its robust capability in handling dynamic and fluctuating conditions within its operational framework."
  },
  {
    "hex_coord": [
      2,
      -11
    ],
    "country": 0,
    "MSU_ids": [
      581,
      584
    ],
    "summary": "TemporalFlowViz is a sophisticated system that integrates multiple advanced techniques to provide insightful visualizations despite certain limitations. At its core, it combines Vision Transformer (ViT) embeddings, interactive trajectory construction, density-based clustering, and expert-augmented semantic summarization to offer comprehensive analysis of temporal data flows. These methodologies work in synergy to enhance the understanding of complex temporal patterns, thus underscoring the system's essential contributions in the field of data visualization."
  },
  {
    "hex_coord": [
      1,
      -2
    ],
    "country": 0,
    "MSU_ids": [
      589
    ],
    "summary": "The multimodal annotation pipeline is designed to streamline the processes of automated reporting, similarity-driven retrieval, and collaborative analysis, significantly reducing the need for manual intervention. By integrating various modalities, the system facilitates efficient data handling and interpretation, offering researchers a powerful tool to enhance their workflows and improve accuracy in analysis. This innovative approach ensures that users can focus more on strategic insights and decision-making rather than on the operational intricacies of data processing."
  },
  {
    "hex_coord": [
      -3,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      602,
      699
    ],
    "summary": "The paper discusses a graphical element designed for user interaction, specifically an image of a button labeled 'Check for updates' characterized by a circular design and featuring a bookmark icon at its center. In parallel, the paper elaborates on a model that describes the transportation process of SGS turbulence kinetic energy, denoted as *ksgs*. These components indicate the integration of visual interface elements and complex scientific modeling to enhance user experience and facilitate advanced computational exploration within the research domain."
  },
  {
    "hex_coord": [
      1,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      603
    ],
    "summary": "The combustion process in scramjet engines typically occurs under unsteady conditions. This unsteadiness poses significant challenges to both the efficiency and stability of the engine's performance. Understanding and managing these dynamic conditions are crucial for optimizing scramjet operation, as they directly influence the combustion efficiency and the overall thrust generation. Researchers are thus focused on developing advanced modeling techniques and control strategies to mitigate the adverse effects of unsteady combustion and enhance the reliability of scramjet engines."
  },
  {
    "hex_coord": [
      -7,
      2
    ],
    "country": 1,
    "MSU_ids": [
      604,
      632,
      646,
      680,
      682,
      694,
      715,
      951
    ],
    "summary": "In a study on supersonic combustion within hydrogen-fueled direct-injection scramjets, Tian et al. investigated different combustion modes, emphasizing the unsteadiness of flames, which can manifest both locally and globally. Most research in this area traditionally focuses on the quasi-steady state, which denotes a stable flame. However, Tian et al.'s study goes beyond this by providing a phenomenological description of the flame stabilization mechanisms through thorough optical and numerical analysis. The study characterizes the temporal evolution of dynamic behaviors such as mode transition and oscillating flame, which reveals potential control mechanisms. This includes recognizing the conditions under which a jet-wake stabilized mode is established; specifically, this mode arises when the cavity recirculation zone entirely disappears, as illustrated by the flame structure in the referenced figure. Additionally, the molecular dynamic viscosity is calculated using Sutherland's law, and the nonlinear reaction rate is gauged by integrating laminar finite-rate chemistry with the volume fraction of fine structures."
  },
  {
    "hex_coord": [
      4,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      605
    ],
    "summary": "Unsteady supersonic combustion represents a critical challenge that must be addressed for the practical implementation of scramjet engines. This issue is of utmost importance as it directly affects the stability and efficiency of these engines in real-world applications. Solving this problem is essential for advancing the operational capabilities of scramjet technology, which is pivotal for high-speed aerospace propulsion systems."
  },
  {
    "hex_coord": [
      -1,
      2
    ],
    "country": 1,
    "MSU_ids": [
      606,
      681
    ],
    "summary": "This study contributes to the advancement of understanding dual-mode scramjet combustion by exploring its operation under varying equivalence ratios. It provides a detailed and vivid illustration of the combustion and flow regimes, enhancing the comprehension of these phenomena in scramjet technology."
  },
  {
    "hex_coord": [
      -4,
      3
    ],
    "country": 1,
    "MSU_ids": [
      607,
      617,
      749,
      880,
      981,
      1031,
      1066
    ],
    "summary": "The paper provides a quantitative analysis of flame dynamics, particularly under conditions involving flow separation, using a variety of measurement techniques including schlieren photography, chemiluminescence, OH-PLIF, and differential interferometry. These analyses reveal that the oscillation modes contribute to intermittent flameouts of varying intensities. In certain stages, such as stage #2, the frequency of these oscillations is significantly higher, attributed to unsteady heat release rates. The study details how large-amplitude shear-layer oscillations can lead to the periodic disintegration of the fuel jet. In Fig. 15(a), a comparative analysis is presented, contrasting the frequency between Proper Orthogonal Modes (POMs) and flame oscillation modes, with white lines indicating a heat release rate (HRR) of 1.0 × 10^9 W/m^3."
  },
  {
    "hex_coord": [
      -10,
      0
    ],
    "country": 1,
    "MSU_ids": [
      608,
      811,
      899,
      994,
      1072
    ],
    "summary": "A study conducted using the *blastFoam* code employed a large-eddy simulation (LES) to model a hydrogen-fueled direct-injection scheme in a scramjet test rig. The results obtained from this simulation showed a strong correlation with extrapolated data from experimental pressure measurements, indicating the validity of the LES approach. The time-averaged Mach number contours, as illustrated in Fig. [8](c), provide detailed insights into the flow characteristics, with a focus on the grey region. Additionally, it is expected that by implementing a higher grid resolution closer to the walls, the accuracy of capturing flow separation will be further enhanced."
  },
  {
    "hex_coord": [
      -9,
      4
    ],
    "country": 1,
    "MSU_ids": [
      609,
      642,
      643,
      655,
      664,
      671,
      693,
      747,
      764,
      802,
      827,
      837,
      853,
      854,
      860,
      862,
      866,
      868,
      903,
      907,
      938,
      946,
      947,
      965,
      974,
      975,
      978,
      985,
      988,
      1000,
      1041,
      1059
    ],
    "summary": "The study investigates the combustion stabilization modes in a Dual-Mode Scramjet (DMSJ) combustor operating under specific conditions, such as a stagnation temperature of 950 K and a pressure of 0.82 MPa. These modes include cavity shear-layer stabilized combustion, cavity assisted jet-wake stabilized combustion, and a combined cavity shear-layer/recirculation stabilized combustion. An experiment conducted by Aguilera et al. examined the scram-to-ram transition using fin-guided injection upstream of the cavity under conditions where the hydrogen fuel, injected into the cavity at Mach 1, is at an ambient temperature of 295 K. The setup involves fuel orifices situated 25 mm downstream of the cavity step. The combustion process is influenced by the mass diffusivity characterized by the molecular Schmidt number. Cavity shear-layer experiences severe flow oscillations, with the most OH radicals concentrated here. At the rear of the shear-layer, a recirculation zone provides radicals and heat to the downstream flame, while hydrogen accumulates at the cavity corner to sustain the upstream flame. Despite flow oscillations, the cavity assisted jet-wake mode is inferred. Subsonic flow peaks and combustion mode transitions are intertwined, often leading to transient flow separations. During the first stage, swing flames result from jet/shear-layer interactions, while the pressure in the cavity increases rapidly. In the subsequent stages, pressure stabilizes, but significant oscillations occur, culminating in stage three, marked by intensive heat release and a large vortex at the cavity exit. This vortex entrains the flame into the cavity floor causing a substantial flame amplitude during this combustion process."
  },
  {
    "hex_coord": [
      -4,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      610,
      831,
      872
    ],
    "summary": "The study presents computational one-dimensional Mach number distributions and compares these results with experimental data, demonstrating a strong alignment between the two. Furthermore, Figure 8a reveals that both computational and experimental cases consistently display the characteristics of a diffusion regime, highlighting the reliability and accuracy of the computational model in capturing the essential aspects of the phenomena under investigation."
  },
  {
    "hex_coord": [
      -2,
      0
    ],
    "country": 1,
    "MSU_ids": [
      611,
      649,
      728
    ],
    "summary": "In their study, Wang et al. investigated combustion dynamics in a scramjet engine where hydrogen is injected upstream of a cavity. They identified two distinct flow-related combustion oscillation mechanisms corresponding to scramjet and ramjet operating modes, which were successfully reproduced to examine typical flame structures. The analysis utilized *BlastFoam*, a computational tool that employs the finite-volume method, enabling detailed numerical simulations of the combustion processes."
  },
  {
    "hex_coord": [
      -8,
      4
    ],
    "country": 1,
    "MSU_ids": [
      612,
      863,
      869,
      873,
      897,
      911,
      924,
      966,
      987,
      1009,
      1016,
      1032,
      1051,
      1055
    ],
    "summary": "In the study, the researchers investigated the local flame structure and flow regime using a modified flame index (MFI) and filter functions to characterize flame regimes, specifically utilizing the Takeno Flame Index (TFI). The stoichiometric mixture fraction, Zst, was determined to be 0.0219, aiding in the analysis of flame behavior. The rich-premixed regime was notably observed near the fuel jet, while the flame in case 1 was located either inside the cavity or near the upper wall of the expansion section. Beyond x = 175 mm, the supersonic downstream flow ratio initially increased but subsequently dropped to a minimum of 43% at the thermal throat. This dynamic was captured in contours of MFI, with black isolines marking stoichiometry. During mode #2, the flame oscillated at the cavity step height, and snapshots indicated a strengthening of thermal choking as the flame oscillated near the lower wall, especially evident in stage #3. The lack of a cavity recirculation zone in ram mode caused the jet-wake flame to oscillate with the separated flow and led to a reduction in the fuel jet's penetration depth. The most energetic proper orthogonal mode (POM), mode #1, was closely aligned with the dominant flame mode. In scram mode, the subsonic recirculation rate peaked at 1.6% at the cavity recirculation core. This comprehensive investigation sheds light on the complex interactions between flame structures and flow regimes within various operational modes."
  },
  {
    "hex_coord": [
      -6,
      3
    ],
    "country": 1,
    "MSU_ids": [
      613,
      629,
      722,
      738,
      817,
      943,
      971,
      1002,
      1053
    ],
    "summary": "The study focuses on the phenomenon of continuous flame flashback during mode transition in a combustor configuration that is favored for its ability to minimize thrust loss and aerodynamic heating. Within this context, the chemical time-scale of multi-step reactions is integrated using the Rosenbrock stiff ODE solver in OpenFOAM, facilitating the computation of overall reaction rates. Approaches to understanding this process are categorized based on the Mach number at the isolator exit. Nakaya's research highlights that vortexes originating from the separated boundary layer can induce a strong jet-wake flame, contributing to high-frequency oscillations linked to acoustic movements in the subsonic region. A detailed view of mode #2 is provided in Fig. 2, where the yellow line represents the dominant mode (mode #1) occurring at a frequency of approximately 8796 Hz. Furthermore, a lean-premixed regime is observed in the narrow layer between the reaction zone and airstream, indicating complex interactions influencing combustion dynamics."
  },
  {
    "hex_coord": [
      -10,
      1
    ],
    "country": 1,
    "MSU_ids": [
      614,
      658,
      840,
      925,
      937,
      980,
      1033
    ],
    "summary": "In their study, Wang et al. investigated the phenomena associated with flame flashback during mode transitions, which can be categorized into three distinct stages: jet/shear-layer interaction, unsteady heat release, and the formation of a large-area separation zone. Experimental observations revealed oscillation characteristics in shock-train structures within an isolator featuring a choked throat. These observations showed distinct flame structures and contours of instantaneous shock and vortex patterns, illustrated by temperature variations. In the initial stage, indicated by dotted circles, flame flashback becomes evident, although both backpressure and flame flashback demonstrate weak propagation abilities during the second stage. Additionally, consistent patterns are observed in lower-frequency modes, suggesting underlying similarities in the dynamic behavior throughout the process."
  },
  {
    "hex_coord": [
      -10,
      4
    ],
    "country": 1,
    "MSU_ids": [
      615,
      625,
      627,
      648,
      665,
      760,
      761,
      823,
      856,
      857,
      861,
      906,
      908,
      933,
      949,
      970,
      984,
      1019,
      1037
    ],
    "summary": "The study investigates the complex fluid dynamics and combustion stability within a combustor during mode transitions, highlighting the influence of flame-holder design and cavity geometry. A cavity measuring 121 mm in length and 11 mm in depth, with a rear-wall-expansion angle of β = 21.1°, is installed on the upper wall, affecting the flow dynamics. Under conditions where the supersonic flow dominates, it helps to minimize energy losses at high flight Mach numbers. However, the system is prone to flow instabilities due to factors such as self-sustained cavity shear-layer oscillations, unsteady jets in supersonic crossflows, and separated boundary layers. Notably, the cavity's design, characterized by a large length-to-depth ratio (L/D = 11), lacks a primary recirculation zone, likely due to interactions between the fuel jet and low-speed separated flow. This configuration contributes to a tendency towards cavity flame blowout, exacerbating combustion instabilities during mode transitions. High-frequency oscillations in pressure, along with multiple reciprocating oscillations and flame flashback phenomena, were observed. The downstream vortex significantly influences flame oscillation characteristics, with vortex interactions maintaining overall flame stability rather than streamwise transport. Local flow behavior, such as the subsonic upstream flow peaking at x = 200 mm and downstream flow peaking at 10% at x = 190 mm, delineates the cavity-recirculation core and other high-pressure zones, crucial for understanding the dynamics of mode transitions in the combustor."
  },
  {
    "hex_coord": [
      -4,
      4
    ],
    "country": 1,
    "MSU_ids": [
      616,
      670,
      1063
    ],
    "summary": "In the study of unsteady jet-wake ram combustion, three distinct oscillation modes were identified. These modes are particularly significant as they correlate with the occurrence of a reversely propagating deflagration flame, which emerges when a thermal choke is established. This phenomenon highlights the complex dynamics at play in the combustion process, particularly under unsteady conditions."
  },
  {
    "hex_coord": [
      -6,
      1
    ],
    "country": 1,
    "MSU_ids": [
      618,
      621,
      709,
      859,
      944
    ],
    "summary": "The study examines the unsteady combustion dynamics in a Dual-Mode Scramjet (DMSJ) engine, identified as a leading candidate for achieving high-speed, lightweight, and long-range propulsion. The research highlights that a key driver of such combustion instability is the motion of coherent structures, which arises from the interplay between low-speed separated flow and fuel jet dynamics. Specifically, the higher jet momentum and lower recirculation velocity observed in certain cases exacerbate these effects. The turbulent Schmidt number, *Sck,<sup>t</sup>*, is established at 0.75, indicating the ratio of momentum and mass diffusion. Vortex formations contribute to transient thermal choking phenomena, which subsequently facilitate the ram combustion stabilization through shear-layer interactions."
  },
  {
    "hex_coord": [
      -5,
      1
    ],
    "country": 1,
    "MSU_ids": [
      619,
      624,
      902
    ],
    "summary": "Recent national research efforts on near-space vehicles have been consistently enhanced to achieve faster speeds and longer strike ranges. When operating within a flight Mach number range of Ma^f = 3 ∼ 6, the airflow entering the combustor is characterized as subsonic, indicating that the vehicle is in ram mode. In this mode, the subsonic region extends to both the isolator and the expansion sections, optimizing the vehicle's aerodynamic performance and efficiency in these specific flight conditions."
  },
  {
    "hex_coord": [
      -2,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      620,
      960,
      1069
    ],
    "summary": "Recent studies emphasize the strategic potential of near-space systems, highlighting their importance in future technological developments. Additionally, investigations into passive-injection schemes are crucial for advancing these systems further. The left image in the study provides vital data, including a black isoline marking at ux = 0 m/s, which serves as an essential reference point in the analysis of near-space system dynamics. Such data is critical for understanding and enhancing the performance and capabilities of these systems."
  },
  {
    "hex_coord": [
      -4,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      622,
      739,
      830,
      1008
    ],
    "summary": "This research paper investigates the design and operation of a scramjet engine capable of functioning both as a scramjet and a ramjet without a physical throat separating the combustor and the expansion system. The study employs computational methods with a maximum Courant number maintained at 0.6 to ensure numerical stability and accuracy. Additionally, the paper provides experimental data on the one-dimensional Mach number distributions, offering insights into the performance characteristics of the engine. Observational snapshots labeled 'B' to 'D' illustrate the sequential motion of the vortexes in operational mode #2, shedding light on the dynamic fluid interactions within the engine."
  },
  {
    "hex_coord": [
      -9,
      2
    ],
    "country": 1,
    "MSU_ids": [
      623,
      626,
      661,
      711,
      717,
      809,
      977,
      1006,
      1065
    ],
    "summary": "The study focuses on optimizing the operational performance of a scramjet engine over a wide Mach number range (Ma^f = 3 ∼ 8) through strategic design, particularly emphasizing the influence of the flame-holder on performance. To investigate the dynamics of hydrogen-fueled dual-mode scramjet (DMSJ) engines, Fotia et al. conducted experimental research, which is complemented by computational simulations. These simulations utilize Marinov's comprehensive hydrogen-air reaction mechanism, incorporating 9 species and 27 elementary reactions, and employ the PaSR model to effectively couple combustion processes with turbulent fluctuations. A notable experiment by Tian provided critical data for comparing computational pressure profiles, notably on the upper wall of the scramjet, validating the model's accuracy. The study reveals that severe flashback phenomena are significantly linked to disturbances in the jet impacting the shear layer under conditions of increased penetrability. This is compounded by a collision that entrains free-stream fluid into the cavity via a vortex, with a large-scale vortex at the cavity exit (476 Hz) effectively sustaining substantial shear-layer oscillations. These insights aim to enhance the scramjet's stability and efficiency across varied aerodynamic conditions."
  },
  {
    "hex_coord": [
      -5,
      2
    ],
    "country": 1,
    "MSU_ids": [
      628,
      762,
      846,
      932,
      979,
      1021,
      1050,
      1068
    ],
    "summary": "In the development of scramjet engines, a common combustor configuration involves a cavity followed by a rearwall expansion section, which are respectively 102.5 mm and 26.5 mm in length. This design facilitates the spread of OH radicals from the fuel orifice into the downstream expansion section, resulting in higher pressures due to increased heat release. During stage #2, the combustor undergoes energy accumulation through this heat release process. Studies on the three-dimensional flow and flame structures have shown that the discontinuous cavity flame stabilizes using two recirculation zones in scram mode. Analysis also compares frequencies between Proper Orthogonal Modes (POMs) and flame modes, along with the spatial structures of the first three POMs. The insights gained from these flame dynamics in direct-injection dual-mode scramjets underscore the necessity for further research into more practical engine configurations and operating conditions."
  },
  {
    "hex_coord": [
      -11,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      630,
      695
    ],
    "summary": "The rapid increase in demand for precise reproduction of flow fields under realistic engine operating conditions necessitates advanced modeling techniques in corresponding configurations. To achieve this, the static pressure \\( p \\) is computed using the ideal gas equation of state. This involves a formulation incorporating various factors, specifically \\( p = \\rho R_u T \\sum_{k=1}^{\\text{Ns}} \\frac{Y_k}{M_k} \\), where \\( \\rho \\) is the density, \\( R_u \\) is the universal gas constant, \\( T \\) is the temperature, \\( Y_k \\) represents the mass fraction of species \\( k \\), and \\( M_k \\) is the molar mass of species \\( k \\) within the system. This equation ensures the accurate determination of static pressure, which is essential for simulating engine behavior under practical conditions."
  },
  {
    "hex_coord": [
      -11,
      0
    ],
    "country": 1,
    "MSU_ids": [
      631,
      1017
    ],
    "summary": "In a fixed-geometry Dual-Mode Scramjet (DMSJ) engine, mode transition control is typically implemented by adjusting the regularity of fuel injection. This process can influence the aerodynamics within the engine, where it is observed that the interval between vortex #1 and vortex #2 is larger than the interval between vortex #2 and vortex #3. Such differences in vortex spacing are critical as they affect the stability and efficiency of the mode transition."
  },
  {
    "hex_coord": [
      -8,
      3
    ],
    "country": 1,
    "MSU_ids": [
      633,
      651,
      663,
      692,
      720,
      744,
      781,
      850,
      894,
      913,
      950,
      991,
      992,
      995,
      1014
    ],
    "summary": "Tian et al. investigated combustion dynamics under Mach 4 flight conditions, discovering that the transition threshold equivalence ratio (ER) was 0.23. They identified two key mechanisms: the unsteady flame propagation due to jet/cavity shear-layer interaction, and oscillations associated with the upstream unsteady pre-combustion shock-train. These oscillations were analyzed through the temporal histories of flame flashback distance, revealing fluctuations in the flame's position over time. In their study, they worked with a high-enthalpy vitiated air comprising 21% O2, 12% H2O, and 67% N2. A numerical simulation involved a computational domain with 342 × 80 × 38 cells within the cavity, which illustrated that the thermal expansion intensified vortex structures, leading to a more distributed high-temperature zone. Despite these conditions, a stable primary recirculation zone in the cavity was absent during ram mode operation, as indicated by the lower recirculation ratio in the corner recirculation zone compared to the separation zone. The fine structure within the flow, characterized by *κ*, was defined by the chemical time-scale *τ<sup>c</sup>* and the SGS mixing time-scale *τm*. Furthermore, vortex shedding showed the dual capability of either promoting or inhibiting the fuel jet's disintegration, playing a crucial role in the jet/cavity dynamics. Measurements from the first three snapshots of the cavity stabilized mode corroborated the presence of recirculation, with evident patterns demonstrating how the waveform of flame oscillation, particularly in case 2, was influenced by these factors."
  },
  {
    "hex_coord": [
      -7,
      3
    ],
    "country": 1,
    "MSU_ids": [
      634,
      740,
      841,
      871,
      886,
      926,
      1010,
      1011
    ],
    "summary": "In their study, Zhang et al. explored the transition process under continuously increasing equivalence ratios. The research involved examining the interaction between the flame and the incoming airstream, where the flame regimes were classified using different Mean Flame Index (MFI) values: no flame (MFI = −2), lean-premixed flame (MFI = −1), diffusion flame (MFI = 0), and rich-premixed flame (MFI = 1). The experimental setup utilized a maximum Courant number corresponding to a physical time-step size of approximately 8 × 10−9 seconds to capture detailed dynamics. Figure 5 of the study presents a comparative analysis of instantaneous shock and shear-layer structures, time-averaged temperature and chemiluminescence, and instantaneous normalized YOH contours for two cases based on experimental optical images. Additionally, the study visualizes contours of the time-averaged Mach number, including a black isoline at sonic speed, and documents the periodic jet penetration depth variation that occurs alongside vortex shedding. Key snapshots of flame evolution emphasize the fuel jet, with a particular focus on temperature variations measured along the x-axis in millimeters, enhancing the understanding of flame dynamics in these conditions."
  },
  {
    "hex_coord": [
      -9,
      1
    ],
    "country": 1,
    "MSU_ids": [
      635,
      885,
      893,
      905,
      923,
      948
    ],
    "summary": "Zhang et al. found that even at high Mach numbers, the large equivalence ratio slope does not cause variations in the pressure rising slope. It's notable that the lean-premixed regime is confined within a narrow layer, emphasizing the delicacy of the process. Vortex structures are primarily initiated by shock/boundary-layer interactions in the isolator region, which profoundly influence flow dynamics. In the scram mode (case 1), the downstream flow remains predominantly supersonic, exceeding 90%. The accompanying image delineates contours of the instantaneous modified flame index, with shock and vortex structures shaded by temperature, and provides a visualization of the time-averaged Mach number across two distinct cases. Additionally, Figure [11] illustrates the progression of the low-energy stream, highlighting important aspects of the fluid mechanics involved."
  },
  {
    "hex_coord": [
      -10,
      3
    ],
    "country": 1,
    "MSU_ids": [
      636,
      637,
      638,
      769,
      839,
      876,
      883,
      912,
      921,
      958,
      972,
      1005,
      1036,
      1042
    ],
    "summary": "Huang et al. conducted a numerical exploration of the mode transition process in a strut-based combustor using a combined injection strategy. Their study emphasized the significant impact of airflow conditions and the jet to crossflow pressure ratio on the transition process apart from the injection strategy. By varying the injection pressure, Yan et al. further analyzed the transition processes between scram and ram modes. To simulate the fully-developed inflow, synthetic turbulence with a 5% fluctuation intensity was introduced using the LEMOS generator, following a 1/7th power law. The entrainment of cold hydrogen led to a temperature variation between the cavity's front and rear sections. Visual data revealed time-averaged distributions of velocity vectors with streamwise components, superimposed by instantaneous heat-release rate contours and an iso-surface of Y_H2 = 0.1, differentiating cavity recirculation and local extinction in one case from non-recirculation and corner recirculation zones in another. Observations noted subsonic upstream flow peaks within the engine at distinct locations, with a normal shock evident at the cavity entrance. During mode transition, streamwise velocity and Mach number snapshots captured the decay of cavity recirculation and the establishment of thermal choke. The pressure response in the isolator tail illustrated upstream propagation of backpressure. At one snapshot, a shedding vortex collided with the cavity's rear-wall. This upstream vortex interacted with the fuel jet, affecting the jet's penetration depth periodically, and was generated by a sudden contraction entering the expansion section."
  },
  {
    "hex_coord": [
      -8,
      0
    ],
    "country": 1,
    "MSU_ids": [
      639,
      935,
      1004,
      1038
    ],
    "summary": "The study's findings indicate that the transition from ramjet (ram) to scramjet (scram) is more challenging than the reverse transition from scram to ram. This difficulty is illustrated in Fig. 10, where the first three snapshots depict a sudden increase in injection pressure leading to violent oscillation in the shear layer. Fig. 14 further provides important flame snapshots corresponding to the phases shown in Fig. 13, highlighting the transitional dynamics. Additionally, during mode #2, a larger counter-rotating vortex pair is generated, contributing to the complex fluid dynamics observed during these transition phases."
  },
  {
    "hex_coord": [
      -4,
      2
    ],
    "country": 1,
    "MSU_ids": [
      640,
      835
    ],
    "summary": "The research investigated the dynamics of shock waves within the isolator as the combustor transitioned into scram mode. During this phase, the study successfully demonstrated the spatial alignment between the high-temperature zone and the flame structure, ensuring efficient combustion under the scram conditions. This alignment highlights the effective interaction between the shock wave dynamics and the thermal patterns crucial for high-speed propulsion systems."
  },
  {
    "hex_coord": [
      0,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      641,
      689
    ],
    "summary": "Significant effort has been dedicated to understanding the mechanisms that stabilize combustion processes. A key aspect of this research involves the representation of total energy, which is given by the equation *<sup>E</sup>* = *hs* − *<sup>p</sup>/ρ* + *<sup>u</sup>*<sup>2</sup> *j /*2. In this equation, *hs* denotes the sensible enthalpy, which is crucial for accurate assessment of energy dynamics within combustion systems. This formula illustrates the interplay between various thermodynamic quantities, including pressure *p*, density *ρ*, and velocity *u*, contributing to the overall stability of combustion. Understanding these relationships allows for better control and optimization of combustion in practical applications."
  },
  {
    "hex_coord": [
      -5,
      3
    ],
    "country": 1,
    "MSU_ids": [
      644,
      668,
      814,
      848,
      867,
      870,
      878,
      986,
      1022,
      1043
    ],
    "summary": "Yuan et al. and Kato et al. investigated the flame stabilization behavior during the scram to ram transition in dual-mode scramjet (DMSJ) engines. Yuan et al. found that the flame is stabilized in the cavity shear-layer during scram mode and transitions to the jet-wake during ram mode. Meanwhile, Kato et al. conducted experimental research to further explore this transition. Various methods have been suggested to accurately determine the operating mode of the DMSJ engine, with one key focus being on the flame behavior and dynamics. The current study introduces a Modified Flame Index (MFI), which includes the unit-volume heat-release rate as a new parameter for analysis. For instance, a volume-averaged heat-release rate of HRR = 2 × 10^8 W/m^3 is used, and this distribution is depicted alongside the instantaneous heat-release rate contour for enhanced analysis. Additionally, it has been noted that the temperature in the cavity is significantly higher than in other test cases. Furthermore, large-amplitude oscillations stemming from cycles of pressurization and depressurization are observed, and the study suggests that these low-frequency oscillations can potentially be mitigated through the optimization of the combustor's dimensional parameters. Finally, a temporal comparison of flame modes and Port-Operated Modes (POMs) is conducted to understand the oscillatory behavior better."
  },
  {
    "hex_coord": [
      -4,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      645
    ],
    "summary": "Recent studies have extensively investigated scramjet technologies, experimenting with various configurations and fuel injection schemes. This research is vital for advancing the efficiency and reliability of scramjet engines, which are pivotal for high-speed aerospace applications. Through a range of experimental setups and methodologies, significant insights have been gained into optimizing these propulsion systems, ultimately contributing to the broader understanding of scramjet dynamics and enhancing their performance in real-world scenarios."
  },
  {
    "hex_coord": [
      -2,
      2
    ],
    "country": 1,
    "MSU_ids": [
      647,
      1020
    ],
    "summary": "This paper addresses the limited research on dynamic processes that characterize unstable flames, including ignition dynamics, thermoacoustic oscillations, flame flashback, and flow-induced unstable flames. It specifically focuses on advancing the understanding of the underlying mechanisms behind flow-induced combustion instability."
  },
  {
    "hex_coord": [
      -3,
      2
    ],
    "country": 1,
    "MSU_ids": [
      650,
      824
    ],
    "summary": "The study explores a key mechanism in combustion dynamics, specifically focusing on the intermittent auto-ignition of mixture packets associated with the fuel jet. This phenomenon plays a crucial role in influencing the combustor's behavior, particularly noted in the analysis of case 2. Here, the combustor experiences a rapid increase in pressure, caused by intensive chemical reactions within the system. This sharp rise in pressure is a direct consequence of the dynamic interactions between the fuel jet and the auto-ignition of mixture packets, highlighting the intricate processes governing combustion efficiency and stability."
  },
  {
    "hex_coord": [
      -4,
      1
    ],
    "country": 1,
    "MSU_ids": [
      652,
      763,
      852,
      1062
    ],
    "summary": "In their study on cavity-floor direct-injection scramjets, Sitaraman et al. observed low-frequency heat release and pressure oscillations. These oscillations were linked to the establishment of a large-area separation zone, which resulted in the oscillation of combustion modes and eventually led to a complete transition. Additionally, the expansion section had two divergent angles, specifically α = 1.4° and γ = 2°. In the investigated cases, a strong entrainment was noted, particularly in case 1, where it caused the fuel-jet core to develop a branch."
  },
  {
    "hex_coord": [
      -1,
      0
    ],
    "country": 1,
    "MSU_ids": [
      653
    ],
    "summary": "The oscillations observed in the study were ascribed to the periodic fluctuations of jet penetration resulting from its interactions with the shear layer. This interplay between the jet and shear layer dynamic was central to the modulation of jet behavior, significantly impacting oscillatory patterns. Understanding this relationship is crucial for optimizing jet performance and operating conditions in fluid dynamics applications."
  },
  {
    "hex_coord": [
      -11,
      3
    ],
    "country": 1,
    "MSU_ids": [
      654,
      734,
      753,
      768,
      787,
      813,
      815,
      821,
      825,
      887,
      917,
      929,
      964,
      982,
      996
    ],
    "summary": "The study investigates the dynamics within a Dual-Mode Scramjet (DMSJ) engine, focusing on how intensive heat release impacts the inflow conditions via large-scale flow separation caused by upstream-propagating backpressure. The research employs the HLLC-P Riemann solver, which is suitable across a spectrum of flow regimes, from hypersonic compressible to low-speed incompressible flows. Key features of the isolator include an 80 mm expansion section with a divergent angle of α = 1.4°, where the air inlet velocity profile is mapped 50 mm downstream. Experimental and computational pressure profiles are compared, revealing that reflected and pre-combustion shock waves cause a lower measured pressure on the upper wall than the cross-section average. The study categorizes approaches based on the significant pressure-rise point relative to the isolator exit, noting that in case 1, the leading edge of the cavity is the origin of reflected shocks, propagating pressure rise upstream to the isolator. This behavior is attributed to the dilution effect of a downstream-developing rich-mixture. The study further examines pressure and flame evolution during mode transition, emphasizing that during the critical stage (stage #3), the isolator experiences long-term, large-amplitude pressure responses. The flame is particularly vulnerable to the combined influences of large-scale separation vortexes and the fuel jet. The Mach number evolution shows that subsonic region distribution significantly affects flame movement. Time-averaged mass flow ratios of combined speed and direction are also considered, enhancing the understanding of the complex interactions during transition."
  },
  {
    "hex_coord": [
      -6,
      2
    ],
    "country": 1,
    "MSU_ids": [
      656,
      696,
      732,
      758,
      849,
      915
    ],
    "summary": "The paper investigates the complex instability processes arising from interactions with fuel jets, particularly during the transition from scramjet to ramjet operation. The study employs the HLLC-P Riemann solver to calculate conservative hyperbolic fluxes, which assists in analyzing the dynamic behaviors of shock waves and flame propagation in this context. The increased temperatures observed are attributed to more intense heat release and the ram effect within the isolator, which further complicates the instability phenomena. Key parameters in this analysis include the universal gas constant, static temperature, and species molecular weight (*Ru*, *T*, and *Mk*, respectively). For further detailed interpretation, especially regarding visuals, readers are directed to the web version of the article."
  },
  {
    "hex_coord": [
      -7,
      4
    ],
    "country": 1,
    "MSU_ids": [
      657,
      678,
      847,
      939,
      941,
      968,
      997,
      999,
      1015,
      1060,
      1067
    ],
    "summary": "The study aims to develop a detailed understanding of flow characteristics, flame stabilization mechanisms, and unsteady flame dynamics in separated flows. Once the heat release reaches a sufficient level, significant unsteadiness is observed. In these conditions, the jet-wake flame prevails, contributing substantially to the heat release, although there is a negligible presence of OH radicals at the cavity leading edge. As the oscillation period progresses, particularly during the maximum oscillation period from 3.05 ms to 4.45 ms (mode #3), the system experiences a transition marked on Snapshot 'D' from stable combustion to an unsteady transitional mode, eventually forming a jet-wake flame. The flame remains vulnerable to intermittent flameout due to large-amplitude shear-layer oscillations, even during severe shear-layer oscillations. During the second stage, unsteady heat release triggers high-frequency flame flashback. Despite these instabilities, the flame might still revert to a cavity mode under certain conditions. Furthermore, the disintegration of the fuel jet upon collision with the shedding vortex at the cavity step underscores the complex interactions within the flow."
  },
  {
    "hex_coord": [
      -6,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      659
    ],
    "summary": "The study identified that the oscillation of the shock-train was capable of propagating further downstream when interacting with a thicker boundary layer."
  },
  {
    "hex_coord": [
      -7,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      660,
      774
    ],
    "summary": "The study examines the effects of propagation on downstream separated flow, revealing significant coherence and pressure fluctuations. These findings suggest that the dynamics of flow separation are considerably influenced by upstream conditions. Further details on the inflow parameters affecting this process are comprehensively listed in Table 1, providing a clearer understanding of the variables involved in the observed phenomena."
  },
  {
    "hex_coord": [
      -5,
      4
    ],
    "country": 1,
    "MSU_ids": [
      662
    ],
    "summary": "The study noted the occurrence of low-frequency periodic oscillations in the position of the flame when exposed to separated flow conditions. These observations suggest that under such flow configurations, fluctuations in flame dynamics become prominent, potentially indicating underlying mechanisms influencing combustion stability and efficacy."
  },
  {
    "hex_coord": [
      -8,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      666,
      770,
      904
    ],
    "summary": "Yang et al. presented a mechanical model of the DMSJ engine that serves to analyze the mechanisms behind mode transitions. This model includes the extrapolation of supersonic outflow quantities, which are derived from the nearest cells within the computational framework. In the context of the equations provided, particularly Eq. (15), the subscripts 'sub1' and 'sub2' are employed to distinguish between the subsonic downstream and upstream regimes, respectively, facilitating precise representation and analysis of the flow characteristics within the engine."
  },
  {
    "hex_coord": [
      -3,
      1
    ],
    "country": 1,
    "MSU_ids": [
      667,
      669,
      673,
      1047
    ],
    "summary": "In their study, the researchers observed that the mode transition within a scramjet propulsion system was a nonlinear and unstable process, marked by substantial fluctuations in Mach number that adversely affected the system's overall stability. This instability was attributed to the interaction between fluid dynamics and combustion, leading to flame fluctuations within the isolator. Such fluctuations are inherent to the scramjet's combustion flow field, characterized by temporal oscillations impacting fluid flow, mixing, and heat release. Additionally, the fluctuating flame structures were found to correspond to the switching between scramjet and ramjet operating modes."
  },
  {
    "hex_coord": [
      -6,
      4
    ],
    "country": 1,
    "MSU_ids": [
      672,
      855,
      884,
      898,
      967,
      998,
      1001,
      1056,
      1057
    ],
    "summary": "The research findings describe the transition process as characterized by a sequence of flame oscillations attributed to hopping cycles. These cycles involve phenomena such as transient thermal choking, flame flashback, cavity flame-holding, and detachment, collectively referred to as cavity shear-layer stabilized combustion. In the specific scenario labeled Case 2, which affects the inflow side of the flame head, the flame oscillates violently and shows intermittent blowoff downstream. The thermal throat, crucial for shaping the flow and combustion features, is identified at the cavity's rear part. The study employs the height variation of the T = 1800 K isoline at x = 220 mm in the center slice to quantify the level of flame oscillation. Within mode #2 (from 3.45 to 3.90 ms), the flame extends past the cavity step but does not reach the floor, indicating a dynamic oscillation state. During the ram mode, the flow is significantly influenced, with the minimum supersonic flow occurring at the thermal throat (43%), and an increased recirculation rate observed in the isolator separation zone (2%) compared to the corner recirculation zone (1.5%). This intricate behavior emphasizes the complex interactions within the combustion process and the stabilizing effects of the cavity shear-layer."
  },
  {
    "hex_coord": [
      -4,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      674,
      713
    ],
    "summary": "Research into backpressure-induced unstable flames is crucial for understanding their physical mechanisms and developing appropriate control measures, even though separation-driven supersonic combustion instability has not yet been extensively studied. It has been observed that the fine structure of these flames is predominantly influenced by chemical reactions."
  },
  {
    "hex_coord": [
      -11,
      1
    ],
    "country": 1,
    "MSU_ids": [
      675,
      752,
      767,
      773,
      838,
      1073
    ],
    "summary": "The study utilizes large-eddy simulation (LES) to effectively predict time-varying phenomena within a specific setup. The isolator used in the simulation consists of a 70 mm straight section. Simulation parameters at all inlets are set based on Dirichlet boundary conditions derived from experimental data. The study investigates a phenomenological transition from scramjet to ramjet operation by directly altering the injection pressure between two cases, which helps explore the intermediate state of this transition. During the process, cold hydrogen injection is observed to be entrained into the corner recirculation zone, indicating particular flow dynamics. Furthermore, the integration of a dynamic turbulent scalar flux model is expected to enhance the accuracy of capturing flow separation, thereby improving the simulation's effectiveness in capturing complex flow phenomena."
  },
  {
    "hex_coord": [
      -1,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      676,
      1052
    ],
    "summary": "The present study utilizes *blastFoam*, an open-source solver designed for highly compressible reactive systems, to conduct Large Eddy Simulations (LES). The analysis revealed that both examined modes primarily exhibited a diffusion regime as a whole."
  },
  {
    "hex_coord": [
      2,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      677,
      818
    ],
    "summary": "In the study, Large Eddy Simulation (LES) is conducted under two operating conditions that exemplify dual-mode scramjet and ramjet combustion, employing a configuration identical to the experiments carried out by Tian et al. Analysis of Fig. 3 and Fig. 4 reveals that case 1 operates in scram mode."
  },
  {
    "hex_coord": [
      3,
      -9
    ],
    "country": 1,
    "MSU_ids": [
      679,
      916
    ],
    "summary": "The paper organizes its content with a section dedicated to methodology and quantitative analysis, followed by a segment that presents both qualitative and quantitative examinations. This structure allows readers to first understand the research methods applied in the study, before engaging with a detailed comparison of results. The dual approach in evaluation—qualitative and quantitative—ensures comprehensive analysis, providing insights through both statistical data and subjective assessments."
  },
  {
    "hex_coord": [
      5,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      683
    ],
    "summary": "The research culminated in several important conclusions that underscore the efficacy and implications of the study. These findings offer valuable insights into the subject matter, contributing to a deeper understanding and setting the stage for future inquiries. The conclusions derived are instrumental in shedding light on the complexities and potential applications within the field, thereby enhancing the overall body of knowledge and providing a foundation for advancing research."
  },
  {
    "hex_coord": [
      -8,
      1
    ],
    "country": 1,
    "MSU_ids": [
      684,
      782,
      803,
      828,
      1039
    ],
    "summary": "The study utilizes the density-based, multispecies, reactive solver *blastFoam*, developed using the Open-FOAM C++ library, to conduct simulations of flow dynamics. The computational domain is structured with 762 × 137 × 38 cells outside the cavity to effectively capture the fluid behavior. Observations indicate that flow oscillations are predominantly influenced by large-scale separated vortex shedding phenomena. Specifically, when operating in mode #2, the upstream vortex extends significantly to the tail of the isolator, affecting the wetted perimeter (dw) and contributing to the complex flow characteristics observed in the system."
  },
  {
    "hex_coord": [
      -7,
      -6
    ],
    "country": 1,
    "MSU_ids": [
      685,
      963
    ],
    "summary": "The process of deriving the Large Eddy Simulation (LES) governing equations from the reactive Navier–Stokes equations involves utilizing either a local grid-size based spatial filter, indicated by the superscript '-',' or a Favre filter, denoted by the superscript '~'. This application of filtering techniques allows for the simplification of the complex dynamics described by the Navier–Stokes equations, making it possible to study turbulent flows more efficiently. Within this framework, snapshots are captured specifically in the center slice during the transition phase between modes, providing critical insight into the spatial and temporal dynamics of the system during these transitional periods."
  },
  {
    "hex_coord": [
      -5,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      686,
      780
    ],
    "summary": "The research paper utilizes the reactive Navier–Stokes equations, which are essential for modeling fluid dynamics in chemically reactive flows. To achieve accurate simulation results, the study employs a computational model with a substantial resolution, consisting of a total of 5.0 million grid cells. This large number of grid cells is crucial for capturing the complex interactions within the reactive flow, ensuring precision and reliability in the solution of the equations."
  },
  {
    "hex_coord": [
      -3,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      687
    ],
    "summary": "The paper defines the symbols used in the context of fluid dynamics, where *ρ* represents the density, *u <sup>j</sup>* denotes the velocity components along the respective axes, and *τij* is the viscous stress tensor. These parameters are crucial in describing the movement and interaction of fluid particles under various forces in a given system. Understanding these variables facilitates the study of fluid behavior and the application of computational models to simulate real-world scenarios."
  },
  {
    "hex_coord": [
      -8,
      -6
    ],
    "country": 1,
    "MSU_ids": [
      688,
      705,
      741
    ],
    "summary": "In the discussed paper, the authors address the challenge of modeling unresolved terms marked with the superscript '*sgs*'. These terms require careful consideration and modeling due to their complexity and the underlying dynamics they represent. To enhance the accuracy of the model near stationary walls, the authors propose a method to dynamically select model coefficients based on the characteristics of solvable scales in proximity to these walls. This approach allows for the correction of asymptotic behavior, thus improving the model's precision in these critical regions. Furthermore, the residual criterion for convergence within each time-step is meticulously established at 1 × 10−12, ensuring robust and reliable iterative solutions throughout the simulations."
  },
  {
    "hex_coord": [
      -3,
      3
    ],
    "country": 1,
    "MSU_ids": [
      690,
      843
    ],
    "summary": "The thermal diffusivity (*α*) represents the rate at which heat diffuses through a material and is defined by the formula *α* = *λ/cp*, where *λ* is the thermal conductivity and *cp* is the specific heat capacity at constant pressure. In this study, researchers conducted a comparison of time-averaged temperature and chemiluminescence to understand the material's thermal behavior better. By examining these parameters, the study aims to elucidate the relationship between thermal properties and reaction characteristics within the material."
  },
  {
    "hex_coord": [
      4,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      691
    ],
    "summary": "The calculation of thermal conductivity *λ* is performed using Eucken's approximate formula: *λ* = *μcv* (*1*.*32* + *1.77*R/cv*). This formula considers the dynamic viscosity *μ*, specific heat at constant volume *cv*, and the universal gas constant *R*. The approach integrates these thermophysical properties to estimate the thermal conductivity, emphasizing the significance of both molecular motion and heat capacity in determining the heat transfer capabilities of a substance."
  },
  {
    "hex_coord": [
      -2,
      3
    ],
    "country": 1,
    "MSU_ids": [
      697,
      799
    ],
    "summary": "In the study, thermodynamic parameters such as specific heat at constant pressure (*cp*), specific heat at constant volume (*cv*), and enthalpy (*hs*) are calculated using JANAF polynomials, which are standard formulations used in the field to determine thermodynamic properties. The specific heat ratio, denoted by γ, is computed to be 1.4, which is a typical value for diatomic gases under standard conditions. This ratio reflects the relation between *cp* and *cv*, and is critical in understanding the gas behavior and energy transfer processes involved."
  },
  {
    "hex_coord": [
      -4,
      -8
    ],
    "country": 1,
    "MSU_ids": [
      698,
      730
    ],
    "summary": "In their research, Yoshizawa et al. introduced a one-equation eddy-viscosity model designed to efficiently simulate fluid dynamics. To ensure the accurate progression of the evolution equations within this model, the authors employed the third order explicit strong stability-preserving Runge-Kutta method for time advancement. This approach optimizes the stability of the numerical solution while maintaining the third-order accuracy essential for capturing the complex behaviors in fluid flows."
  },
  {
    "hex_coord": [
      1,
      -10
    ],
    "country": 1,
    "MSU_ids": [
      700
    ],
    "summary": "The model is employed to address and resolve the unresolved terms that arise during the filtering process. This resolution is essential for the model's functionality, as it ensures that all components within the framework are accounted for, allowing for more accurate and reliable outcomes. By closing these unresolved terms, the model enhances its overall performance and effectiveness in handling the complexities introduced by the filtering process."
  },
  {
    "hex_coord": [
      1,
      -6
    ],
    "country": 1,
    "MSU_ids": [
      701
    ],
    "summary": "In the given equation, the terms located on the right-hand side are indicative of the various processes affecting the subgrid-scale kinetic energy (*ksgs*). Specifically, these terms are associated with the production, dissipation, and diffusion of *ksgs*, which are fundamental components in understanding the dynamics and interactions at smaller scales within the modeled system. Their careful consideration is crucial for accurately capturing the behavior and evolution of *ksgs* within the context of fluid dynamics or other related fields."
  },
  {
    "hex_coord": [
      -8,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      702,
      816
    ],
    "summary": "In the study of turbulence modeling, the subgrid-scale (SGS) stress tensor and turbulence kinematic viscosity are often key components that need to be accurately modeled. Methods to address these components can be categorized based on the size of the separation zone, which influences the choice of appropriate modeling techniques. This categorization aids in selecting the most suitable approach for effectively capturing the dynamics of turbulence in various flow conditions."
  },
  {
    "hex_coord": [
      -8,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      703,
      735,
      754,
      776,
      888
    ],
    "summary": "The determination of coefficients Cε and Ck in Eqs. (5) and (6) relies on analyzing SGS stresses through a box filter applied at two different scales. In computational simulations, diffusive fluxes are discretized using a second order central differencing method to achieve numerical accuracy. The layout of the computational domain within the CARDC scramjet facility is visually represented by an image, showcasing a highlighted yellow region surrounding the air inlet section, which is essential for mapping the velocity profile. Within this domain, a multi-block structured grid is employed, concentrating mesh density near critical regions such as walls, the cavity shear layer, and the fuel jet to ensure precise calculations. Furthermore, complex flow dynamics are demonstrated by the entrainment of the rich-mixture through counter-rotating streamwise vortex-pairs, enhancing the mixing process in the combustion chamber."
  },
  {
    "hex_coord": [
      -3,
      -6
    ],
    "country": 1,
    "MSU_ids": [
      704,
      1029
    ],
    "summary": "In their analyses, Kim et al. demonstrate that by addressing energy backscatter, one can effectively adapt to the local structures present in actual turbulence. This adaption can be achieved through the normalization of the basis functions *Au* to obtain the Proper Orthogonal Modes (POMs) *<sup>i</sup>*. This methodological approach facilitates a better representation and understanding of the complex dynamics inherent in turbulent flows."
  },
  {
    "hex_coord": [
      -8,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      706
    ],
    "summary": "In the context of filtered Large Eddy Simulation (LES) equations, the turbulent scalar fluxes denoted as *Hsgs<sup>j</sup>* and *<sup>ϒ</sup>sgs<sup>j,k</sup>* represent critical unclosed terms. Understanding and modeling these scalar fluxes is essential for accurately capturing the transport and mixing of scalar quantities in turbulent flows. These unclosed terms necessitate appropriate subgrid-scale modeling to ensure the reliability and precision of LES predictions in complex turbulent phenomena."
  },
  {
    "hex_coord": [
      -2,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      707
    ],
    "summary": "The gradient transport hypothesis is commonly employed as a modeling approach for these terms, providing a framework to understand and simulate their behavior within a system."
  },
  {
    "hex_coord": [
      -7,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      708,
      858
    ],
    "summary": "The study investigates fluid dynamics within the context of turbulent flow, specifically examining the behavior in different scenarios. It highlights a key parameter, the turbulent Prandtl number (*Prt*), which is set to 0.9—a typical value used to describe the ratio of momentum diffusivity to thermal diffusivity in turbulent flow. Additionally, the research identifies and analyzes the formation of a significant corner recirculation zone in case 2, indicating complex flow patterns and interactions within the domain being studied. This recirculation zone suggests substantial energy and momentum exchange, which can influence thermal and velocity profiles within the system."
  },
  {
    "hex_coord": [
      -9,
      3
    ],
    "country": 1,
    "MSU_ids": [
      710,
      745,
      772,
      775,
      832,
      833,
      851,
      881,
      882,
      895,
      936,
      1007,
      1064
    ],
    "summary": "The study investigates the flame stabilization mechanism within a cavity-floor direct-injection scramjet by employing various experimental and modeling approaches. The filtered reaction rate is modeled using the Partially Stirred Reactor (PaSR) model to provide insight into the combustion dynamics under specific conditions. The inflow of high-enthalpy vitiated air is accelerated to Mach 2 at the isolator entry, starting from stagnation conditions of 0.82 MPa and 950 K, with isentropic flow assumptions used to convert these into static values. Two cases with different global equivalence ratios (ER = 0.1 and ER = 0.3) were studied by varying the fuel jet's injection stagnation pressure (1.5 MPa and 4.0 MPa). Flame structure images demonstrate that the combustion stabilization mode is influenced by vortex dynamics and shock wave interactions, showing hairpin-like vortexes from shock/boundary-layer interactions and a counter-rotating vortex pair affecting shear-layer oscillations. Schlieren photography could not fully capture vortex evolution due to long exposure times, but differential interferometry highlights large-amplitude flow oscillations. There is significant dynamic behavior with the flame tail frequently switching between attachment and detachment from the cavity's trailing edge, leading to severe wrinkling and nearly downstream detachment of the flame."
  },
  {
    "hex_coord": [
      -6,
      -9
    ],
    "country": 1,
    "MSU_ids": [
      712
    ],
    "summary": "The model examines each grid cell by identifying two distinct components: the fine structure within the cell itself and the surrounding context. This dual-part analysis allows for a comprehensive evaluation of the spatial arrangements and interactions at both micro and macro levels, facilitating a detailed understanding of the complex dynamics present in the system. By differentiating and analyzing the fine structure alongside its surrounding environment, the model provides insights into the nuanced interdependencies and structural intricacies that influence overall behavior and patterns."
  },
  {
    "hex_coord": [
      -11,
      2
    ],
    "country": 1,
    "MSU_ids": [
      714,
      733,
      759,
      792,
      807,
      934,
      940,
      952,
      953,
      1018
    ],
    "summary": "The paper investigates the dynamics of turbulent mixing and flow behavior in a combustor system, focusing particularly on how the HLLC-P Riemann solver addresses distortion and instability issues in low Mach number regions, effectively enhancing the performance of the traditional HLLC scheme. The study features a 30 mm entry through which air dynamically balances with the combustor's pressure, ensuring stable operation. Multiscale turbulence is captured, especially at the expansion fan, due to local mesh refinement, highlighting complex interactions within the flow. Computational comparisons of pressure profiles on the upper wall, validated against experimental data by Tian, reveal critical insights into the pressure evolution and boundary layer behavior. The separated flow distorts the flame leading edge, occasionally causing flashback. Observations indicate that the boundary layer separates due to an adverse pressure gradient when shock waves move upstream, reattaching when normal shock forms at the separation point downstream. Additionally, vortices within the flow, specifically vortices #2 and #3, gradually merge and enlarge further downstream, delineating the intricate nature of flow interactions in the system."
  },
  {
    "hex_coord": [
      -2,
      1
    ],
    "country": 1,
    "MSU_ids": [
      716
    ],
    "summary": "In this study, the laminar reaction rate *ω*˙ *<sup>k</sup>* is determined by employing the Arrhenius formula applied to filtered quantities. This approach provides a framework for accurately computing the reaction rate within laminar flow conditions, ensuring that the derived rates are reflective of the precise chemical kinetics as influenced by temperature and concentration factors described in the Arrhenius equation."
  },
  {
    "hex_coord": [
      -1,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      718,
      829
    ],
    "summary": "The study utilizes a sophisticated mechanism aimed at accurately replicating the practical chemical kinetics involved in dynamic combustion processes. To validate this approach, a comparative analysis is conducted between experimental and computational outcomes, focusing specifically on one-dimensional Mach number distributions. This comparison encompasses two distinct cases where the data is precisely plotted along the x-axis measured in millimeters, thereby highlighting the fidelity of the computational model in reflecting experimental observations."
  },
  {
    "hex_coord": [
      2,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      719
    ],
    "summary": "Previous studies have established the validity of this mechanism in the context of supersonic combustion, providing a solid foundation for its application in related research areas."
  },
  {
    "hex_coord": [
      3,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      721
    ],
    "summary": "The volume fraction of the fine structure, denoted as *κ*, is calculated using the formula *κ* = *τc* / (*τc* + *τm*). This equation integrates specific time constants that characterize the respective phases present in the structure."
  },
  {
    "hex_coord": [
      1,
      0
    ],
    "country": 1,
    "MSU_ids": [
      723
    ],
    "summary": "The total molar concentration, referred to as *ctot*, represents the sum of the molar concentrations of all species present in a given system. This parameter is crucial for understanding the overall composition and behavior of chemical systems, as it encompasses the collective contribution of all chemical entities involved. By evaluating the total molar concentration, researchers can derive insights into reaction dynamics, equilibrium states, and potential changes in properties due to concentration variations."
  },
  {
    "hex_coord": [
      0,
      1
    ],
    "country": 1,
    "MSU_ids": [
      724,
      1045,
      1061
    ],
    "summary": "The study utilized Large Eddy Simulation (LES) with the *blastFoam* code to investigate the combustion processes, integrating detailed finite-rate chemistry to accurately model chemical reactions. Key variables in this simulation were the stoichiometric coefficient (*νs,<sup>r</sup>*) and the forward reaction rate (*K <sup>f</sup> ,<sup>r</sup>*) for each reaction *r*, which are critical for understanding the reaction dynamics. During the final stage of the combustion process, the intensive heat release resulted in the formation of a large-area separation zone, indicating significant alterations in flow dynamics due to thermal effects."
  },
  {
    "hex_coord": [
      -8,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      725,
      731
    ],
    "summary": "In the study, the authors examine the turbulent mixing process at subgrid scales, noting that these scales are comparable to the Kolmogorov scale, making it possible to calculate the time scale of subgrid scale (SGS) turbulent mixing accurately. To enhance the interpolation process at the interface, the study employs a second order Monotone Upstream-Centered Schemes for Conservation Laws (MUSCL) reconstruction. This method is augmented by the use of the Van Leer limiter, which effectively interpolates the left and right states at the interface, ensuring higher fidelity and stability in resolving the complexities of turbulent mixing."
  },
  {
    "hex_coord": [
      1,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      726
    ],
    "summary": "In the present work, the formula *Cmix* = 1 / (1 + *CμRet*) is presented, with the constant *<sup>C</sup><sup>μ</sup>* being specified as 0.09. This expression is likely a part of a mathematical or computational model used within the study, where *Cmix* is a calculated parameter dependent on the term *CμRet*."
  },
  {
    "hex_coord": [
      -7,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      727,
      737,
      805
    ],
    "summary": "The study primarily focuses on the computational analysis of turbulent flow dynamics within a supersonic channel, where the mixing coefficient *Cmix* is approximately 0.01, indicative of typical turbulent flow conditions. For simulations, the authors employ Large Eddy Simulation (LES) on a specialized computational grid designed to capture the intricate flow characteristics. The numerical solution is enhanced by the use of the Preconditioned Bi-Conjugate Gradient Stabilized (PBiCGStab) method, which is further optimized with the Diagonal Incomplete LU (DILU) preconditioning technique, improving the efficiency and stability of the computations necessary for accurately modeling such complex systems."
  },
  {
    "hex_coord": [
      -6,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      729,
      746
    ],
    "summary": "*BlastFoam* utilizes a cell-centered data storage structure to discretely solve the computational domain. This approach is applied under conditions that simulate a Mach 4 flight scenario."
  },
  {
    "hex_coord": [
      5,
      -9
    ],
    "country": 1,
    "MSU_ids": [
      736,
      1025
    ],
    "summary": "The study involves solving algebraic equations derived from the analysis of 2-D velocity vector snapshots, utilizing the PBiCGStab method for computation."
  },
  {
    "hex_coord": [
      -8,
      2
    ],
    "country": 1,
    "MSU_ids": [
      742,
      801,
      808,
      892,
      909,
      1003,
      1012,
      1035,
      1040
    ],
    "summary": "A laboratory-scale direct-connect scramjet facility featuring a cavity flame-holder is being developed at the China Aerodynamics Research and Development Center (CARDC). In the study, case 1 and case 2 demonstrate different aerodynamic and fluid dynamic phenomena. The wall skin-friction coefficient, Cf, is measured as 0.003. Computational analysis reveals that the pressure profiles on the upper wall of case 1 align well with Tian's experimental findings. In the cavity of case 2, the 3-D vortex structures are observed to be larger than those in case 1, with flow downstream being nearly symmetrical between supersonic and subsonic modes in ram mode (case 2). The research identifies a dominant mode characterized by self-sustained shear-layer oscillations caused by vortex shedding. Key snapshots depict the evolution of the flame, capturing important dynamics. Specifically, in mode #1, the interaction between high-speed and low-speed flows results in the formation of counter-rotating vortices. Mode #3 highlights coherent structures associated with the largest-amplitude flame oscillations, providing insights into the complex flow dynamics within the scramjet configuration."
  },
  {
    "hex_coord": [
      -6,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      743,
      757
    ],
    "summary": "The study describes a facility specifically designed to simulate flight conditions occurring at Mach numbers between 4 and 7. Within this setup, a key component involves mapping the air inlet section, as indicated by the green line, to analyze the velocity profile crucial for understanding airflow characteristics under these high-speed conditions. This mapping allows for a detailed examination of the aerodynamic performance and behavior within the test environment, aiding in the refinement of models and technologies applicable to hypersonic flight scenarios."
  },
  {
    "hex_coord": [
      2,
      -9
    ],
    "country": 1,
    "MSU_ids": [
      748
    ],
    "summary": "The research paper references a range of experimental studies that have been conducted using the described facility, as documented extensively in existing literature."
  },
  {
    "hex_coord": [
      -11,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      750
    ],
    "summary": "The yellow region depicted in Fig. [1] represents the computational domain, which is a crucial aspect of the study as it defines the boundaries within which the simulations or analyses are conducted. This section of the figure highlights the area of interest for the computational modeling, facilitating a focused examination of the phenomena under investigation. Understanding the specifics of this region is essential for interpreting the results presented in the study."
  },
  {
    "hex_coord": [
      -7,
      0
    ],
    "country": 1,
    "MSU_ids": [
      751,
      962,
      1046
    ],
    "summary": "The study investigated a geometric configuration with a total length of 400 mm. The analysis, depicted in the right-side image, includes a black isoline representing the sonic speed. The research successfully replicated two distinct flame structures: the cavity shear-layer flame and the cavity-assisted jet-wake stabilized flame, demonstrating the effectiveness of the model in capturing these complex phenomena."
  },
  {
    "hex_coord": [
      -1,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      755
    ],
    "summary": "The CARDC scramjet facility is designed as a sophisticated installation for testing scramjet engines. A sketch of the facility reveals its structural components, illustrating the intricacies involved in simulating realistic flight conditions for scramjets. The layout emphasizes the aerodynamic features essential for accommodating high-speed airflow, critical to reliable scramjet operation. This facility supports advanced research and development by providing a controlled environment to study airflow dynamics and engine performance under varying conditions, thereby contributing significantly to the advancement of hypersonic propulsion technologies."
  },
  {
    "hex_coord": [
      -10,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      756
    ],
    "summary": "The computational domain is delineated by the channel enclosed within the yellow region."
  },
  {
    "hex_coord": [
      -4,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      765
    ],
    "summary": "The study addresses the challenges associated with the high computational cost typical of full-scale models. To mitigate this, the researchers have opted to strategically reduce the scale of their computational domain, preserving only 1/15th of the width, amounting to 10 mm. This approach effectively balances the need for detailed analysis with computational efficiency, demonstrating a method to optimize resources without significantly compromising the integrity of the results."
  },
  {
    "hex_coord": [
      -5,
      0
    ],
    "country": 1,
    "MSU_ids": [
      766,
      901,
      973,
      1054
    ],
    "summary": "This study investigates the behavior of flow within a combustor operating in scramjet mode, particularly focusing on the application of periodic boundary conditions along the span-wise direction around a single fuel orifice. In scram mode, the research reveals that more than 90% of the flow within the combustor maintains a supersonic velocity, with exceptions observed primarily within the cavity region. Furthermore, the dynamic progression of the flame flashback is systematically categorized into three distinct stages, each reflecting varying degrees of severity in its occurrence. This categorization aids in understanding the impact and management of flame flashback within high-speed combustor environments."
  },
  {
    "hex_coord": [
      -9,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      771,
      779,
      795
    ],
    "summary": "The study examines the imposition of a no-slip adiabatic boundary condition on all walls within a computational fluid dynamics simulation, which is particularly relevant for grids compatible with dynamic turbulence models. However, the research identifies that the lack of adequate near-wall resolution is likely the most critical factor contributing to the overprediction observed in the simulation results. Improved near-wall resolution could significantly enhance the accuracy of predictions made by the turbulence models utilized in the study."
  },
  {
    "hex_coord": [
      -9,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      777,
      990
    ],
    "summary": "In the study, the initial setup includes positioning the first node at a distance of 0.01 mm from the wall. This configuration is crucial for accurately capturing the temporal histories of pressure signal oscillations within the system. By establishing a precise node placement, the research effectively monitors and analyzes the behavior of pressure fluctuations over time, contributing to a comprehensive understanding of the system's dynamic response."
  },
  {
    "hex_coord": [
      -5,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      778
    ],
    "summary": "The dimensionless quantity denoted as *y*+ is equal to 10 in the context of the research presented in the paper. This value of *y*+ is significant because it likely pertains to a specific point within fluid dynamics or heat transfer analysis, where *y*+ typically represents a normalized distance from a wall or boundary in turbulent flow scenarios. The choice of 10 as the value for *y*+ might be used to indicate a particular regime or behaviour in the system being studied, such as the onset of turbulent mixing or a shift in the wall shear stress characteristics. The use of dimensionless numbers like *y*+ is common in such analyses as they help facilitate the comparison and scaling of results across different systems and experimental setups."
  },
  {
    "hex_coord": [
      -1,
      3
    ],
    "country": 1,
    "MSU_ids": [
      783,
      942
    ],
    "summary": "In Nakaya's studies, it was reported that an oscillation phenomenon exists between two combustion modes. This oscillation can be characterized by the volume fraction *τc/ (τ<sup>c</sup>* + *τm)*, which approaches unity. Specifically, in the observed cases, the volume fractions were 0.983 and 0.878, respectively, indicating a near-complete dominance of one mode over the other in these instances."
  },
  {
    "hex_coord": [
      -9,
      0
    ],
    "country": 1,
    "MSU_ids": [
      784,
      1044
    ],
    "summary": "The study conducted a Large Eddy Simulation (LES) of a hydrogen-fueled direct-injection scramjet, revealing that the finite-rate chemical kinetics effect is present throughout nearly the entire domain where the condition *τ<sup>c</sup> τm* is met."
  },
  {
    "hex_coord": [
      -10,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      785,
      945,
      957
    ],
    "summary": "In the study, the authors examined the dynamics of flame behavior during mode transition, focusing specifically on the subgrid-scale (SGS) turbulence and its effects. They found that SGS turbulence has a minimal impact on the overall process. This conclusion is supported by instantaneous snapshots of YOH concentrations captured at the center slice during the transition. Particularly notable are snapshots 'E' and 'F,' where the leading edge of the flame is drawn into the corner recirculation zone. This entrainment plays a critical role in the interaction patterns observed, highlighting the spatial dynamics that occur even with limited influence from SGS turbulence."
  },
  {
    "hex_coord": [
      3,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      786,
      836
    ],
    "summary": "In the study, it was determined that the grid resolution employed was adequate for capturing the interactions between chemical reactions and turbulence within the system. Specifically, in the case referred to as \"scram mode,\" the reaction zone was observed to form a 'V' shape. This indicates that the computational setup was effectively capable of resolving the complex dynamics occurring in these turbulent combustion scenarios."
  },
  {
    "hex_coord": [
      -2,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      788
    ],
    "summary": "In this study, data collection was carried out after six flow-through times following a duration of five times the flow-through time constant \\( \\tau_f \\). This approach was implemented to ensure the system had reached a statistical steady state, thereby allowing for an accurate analysis of the flow dynamics in the experimental setup. The process involved observing the system until it stabilized at a statistical equilibrium, offering reliable conditions under which the flow mechanisms could be comprehensively evaluated. Such methodological rigor is crucial for obtaining valid and reproducible results in flow dynamics experiments."
  },
  {
    "hex_coord": [
      -5,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      789,
      1026
    ],
    "summary": "For case 1, a grid independence study is conducted using both coarser grids with 1.0 million cells and finer grids with 7.0 million cells, each topologically identical. To analyze the dominant frequency of each Proper Orthogonal Decomposition (POD) mode, the Fast Fourier Transform (FFT) is applied to their respective temporal coefficients, facilitating the determination of frequency characteristics associated with each mode."
  },
  {
    "hex_coord": [
      -9,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      790,
      874
    ],
    "summary": "The analysis of the pressure distributions on the upper wall reveals that, with the exception of the leading edge of the expansion section, the distributions are almost identical. Beyond the leading edge, the diffusion regime becomes the predominant factor influencing the pressure distribution in the remaining region."
  },
  {
    "hex_coord": [
      -5,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      791,
      844,
      891,
      1013
    ],
    "summary": "The study discusses the comparison of different grid resolutions in computational simulations, noting that moderate and finer grids tend to predict lower values compared to coarser grids, aligning with findings from Cao's research. The analysis includes examining instantaneous normalized YOH contours from two cases within the central slice, which are compared to experimental optical images for validation. Additionally, vortex structures within the flow are identified using the Q-criterion iso-surface at a threshold of 1 × 10<sup>5</sup> s<sup>−1</sup>. The investigation also involves detailed snapshots, focusing specifically on close-up views of the fuel jet to provide further insights into the behavior and characteristics of the flow field."
  },
  {
    "hex_coord": [
      -12,
      0
    ],
    "country": 1,
    "MSU_ids": [
      793,
      842,
      969
    ],
    "summary": "The study carries out simulations on a moderate grid size of 5.0 million cells to strike a balance between fidelity and computational efficiency. It involves a comparative analysis of instantaneous shock and shear-layer structures, highlighting their dynamics and interactions. Additionally, the temporal evolutions of pressure signals and the flame flashback distance are meticulously presented, as illustrated in Fig. 12, providing insights into their behavior over time."
  },
  {
    "hex_coord": [
      -10,
      2
    ],
    "country": 1,
    "MSU_ids": [
      794,
      914,
      928,
      931
    ],
    "summary": "In the study, the pressure distribution on the upper wall closely aligns with experimental results for both cases, with the exception of a slight overprediction at the separation point pressure in the isolator for case 2. Additionally, the corner recirculation zone in case 2 exhibits a higher recirculation ratio compared to case 1 at the same location. The analysis includes an image depicting the time-averaged mass flow ratio across different scenarios, which emphasizes areas of subsonic and supersonic flow both upstream and downstream. Notably, the shock waves extend farther upstream in the studied configurations."
  },
  {
    "hex_coord": [
      -11,
      4
    ],
    "country": 1,
    "MSU_ids": [
      796,
      822,
      919
    ],
    "summary": "In this study, a high-pressure jet near the inlet is observed to undergo a sharp pressure drop during rapid expansion, although this phenomenon is not detected by discrete pressure measurements. Meanwhile, the obstruction of the cavity shear-layer enhances the reflected shocks. Additionally, an increase in injection pressure results in the formation of a high-pressure zone beneath the jet, attributed to the impediment effect caused by the forward propagating shocks."
  },
  {
    "hex_coord": [
      -4,
      -6
    ],
    "country": 1,
    "MSU_ids": [
      797,
      1024
    ],
    "summary": "The Proper Orthogonal Decomposition (POD) technique is utilized to identify large-scale coherent structures that significantly influence the flow field. While performing the POD analysis, the discrepancies observed in the results are considered acceptable due to the inherent complexity and variability associated with fluid dynamics. The application of POD provides valuable insights into the dominant flow structures, facilitating a deeper understanding of their impact on the overall flow behavior."
  },
  {
    "hex_coord": [
      -1,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      798
    ],
    "summary": "The study utilizes a one-dimensional pressure/Mach number response model to verify the distributions of Mach numbers against the experimental pressure profiles. This approach ensures the accuracy of the Mach number calculations by directly correlating them with observed pressure data obtained from the experiments. The model serves as a crucial tool in validating the experimental results, thereby enhancing the reliability of the findings related to the Mach number distribution."
  },
  {
    "hex_coord": [
      -2,
      -10
    ],
    "country": 1,
    "MSU_ids": [
      800
    ],
    "summary": "The cross-sectional area of the channel, denoted as A, is a key parameter that influences various hydrodynamic properties and behaviors within the system being studied. Understanding and accurately measuring this area is crucial for predicting fluid flow characteristics and other related phenomena."
  },
  {
    "hex_coord": [
      -4,
      0
    ],
    "country": 1,
    "MSU_ids": [
      804
    ],
    "summary": "The paper presents a computational grid used for Large Eddy Simulation (LES), alongside a graph illustrating the volume fraction distribution of the ratio τc/(τc + τm) for two distinct cases. This visualization aids in understanding the spatial arrangement and distribution characteristics within the simulation, offering insights into the dynamics of the modeled phenomena."
  },
  {
    "hex_coord": [
      0,
      2
    ],
    "country": 1,
    "MSU_ids": [
      806,
      845
    ],
    "summary": "The study investigates the volume fraction distribution of τc relative to the total of τc and τm within a specific experimental setup. In the scenario referred to as \"case 2,\" which employs the ram mode, the distribution exhibits a distinct parabola shape, visually reminiscent of a torch. This configuration provides insight into the spatial arrangement and relative concentration of the components under the given conditions, highlighting the characteristic geometric patterns that emerge from the distribution process."
  },
  {
    "hex_coord": [
      -4,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      810
    ],
    "summary": "In the study, Mach number (Ma) distributions are derived from large eddy simulations (LES) through the use of a cross-section averaging method. This approach allows for an efficient analysis of flow characteristics by averaging the data across a specified cross-sectional area, providing a detailed and accurate representation of the Mach number distributions within the simulated environment."
  },
  {
    "hex_coord": [
      -7,
      1
    ],
    "country": 1,
    "MSU_ids": [
      812,
      896,
      918,
      920,
      1058
    ],
    "summary": "In this study, the behavior of flame propagation and fluid dynamics within different configurations was analyzed, focusing particularly on cases involving cavities and isolators where maximum error amounts were observed. The analysis reveals that both flame types are effectively confined within vortex structures, which significantly enhance the mixing of fluids. In the simulations, the left-hand figures illustrate the propagation direction of oblique shocks using white arrows. Particularly at snapshot 'C', these shocks are redirected back into the cavity due to a combination of pressure relief and insufficient heat release. The transition from scramjet to ramjet mode, which is closely associated with flame behavior, is characterized by three distinct stages. These findings underscore the complex interactions between shock dynamics and flame behavior, influencing overall fluid flow and combustion processes."
  },
  {
    "hex_coord": [
      0,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      819,
      1023
    ],
    "summary": "From the analysis of Figures 3 and 4, it is deduced that case 2 operates in ram mode. This is further elucidated by examining the spatial structures of the first three Principal Oscillation Modes (POMs), which highlight the dynamics and interactions characteristic of this mode. The examination of POMs provides critical insights into the system's performance and efficiency in ram mode, offering a deeper understanding of the underlying spatial configurations and behaviors."
  },
  {
    "hex_coord": [
      -7,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      820
    ],
    "summary": "Figure 5a of the paper provides a detailed depiction of the shock and shear-layer structures, illustrating their spatial relationships and dynamics within the studied system. These structures play a critical role in the overall fluid dynamics, influencing flow behavior and stability. Through careful analysis of the image, the paper elaborates on the interactions between shock waves and shear layers, offering insights into their impact on performance and efficiency in engineering applications. This visualization is integral to understanding the complex phenomena addressed in the study, contributing to the theoretical and practical advancements in the field."
  },
  {
    "hex_coord": [
      -12,
      1
    ],
    "country": 1,
    "MSU_ids": [
      826,
      910,
      955,
      956,
      989
    ],
    "summary": "The paper investigates the development and behavior of a shock train in a separated boundary layer originating at x = 20 mm. At x = 175 mm, the transition between supersonic and subsonic flow occurs, with both regimes equally occupying 50% of the downstream flow. This mode transition is captured through instantaneous snapshots, depicting pressure and Y_OH in the center slice, which illustrates the dynamics of shock motion and flame flashback over time. Additionally, these snapshots reveal the temporal evolution of pressure signals alongside the oscillations in flame flashback distance, segmented into three distinct stages, providing insights into the complex interactions during the transition process."
  },
  {
    "hex_coord": [
      -5,
      -8
    ],
    "country": 1,
    "MSU_ids": [
      834
    ],
    "summary": "The computational analysis has yielded results that precisely replicate the visual outcomes depicted in the images, demonstrating the efficacy of the methodologies employed."
  },
  {
    "hex_coord": [
      -6,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      864
    ],
    "summary": "In the context of diffusion regimes, the Transient Flow Indicator (TFI) is represented by a value of −1, which signifies specific characteristics associated with such regimes."
  },
  {
    "hex_coord": [
      -2,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      865,
      930
    ],
    "summary": "In the study, TFI (Turbulence Fuel Index) equal to 1 characterizes the premixed combustion regimes, indicating that the fuel and oxidizer are mixed homogeneously before ignition. The observation of the reciprocating process between specific snapshots, labeled 'D' and 'E', further supports this premixed regime characterization. These snapshots help visualize the dynamic behavior and interaction within the combustion process, underscoring the significance of turbulence in influencing the mixing and burning efficiencies."
  },
  {
    "hex_coord": [
      -6,
      0
    ],
    "country": 1,
    "MSU_ids": [
      875
    ],
    "summary": "The positions corresponding to the rich-premixed regime vary between the two examined scenarios."
  },
  {
    "hex_coord": [
      -7,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      877,
      959
    ],
    "summary": "The study presents both the time-averaged distribution of velocity vectors and their instantaneous snapshots, providing a comprehensive analysis of the flow dynamics. In the time-averaged visualization, the velocity vectors are effectively colored by their streamwise components, allowing for an intuitive understanding of the overall flow patterns across the examined plane. Additionally, the instantaneous snapshots capture the variability and transient features of the streamwise velocity, highlighting the fluctuations and temporal developments within the flow field. This approach offers a detailed depiction of both steady and dynamic aspects of velocity behaviors."
  },
  {
    "hex_coord": [
      1,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      879
    ],
    "summary": "In both case 1 and case 2, the distribution overlaps with the iso-surface where the mole fraction of \\(Y_{H2}\\) equals 0.1. This suggests a consistent pattern across the two cases, indicating a potential similarity in the spatial arrangement or reaction zones where hydrogen concentration reaches this specific value. Such an overlap is significant for understanding the mixing or reaction dynamics within the studied system."
  },
  {
    "hex_coord": [
      5,
      -6
    ],
    "country": 1,
    "MSU_ids": [
      889
    ],
    "summary": "Liu's research had previously documented this phenomenon, indicating an established recognition of these findings within the academic community. The study conducted by Liu provides foundational insights that contribute to the ongoing exploration and understanding of this particular phenomenon, reinforcing its relevance and significance in the field."
  },
  {
    "hex_coord": [
      -10,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      890
    ],
    "summary": "Figure 8(b) of the referenced paper presents the perspective views of the engine. This visualization provides insights into the spatial configuration and design features of the engine, highlighting key aspects relevant to the study. Through this detailed perspective, the figure assists in illustrating the specific components and their interactions, contributing significantly to the comprehensive understanding presented in the paper. The representation aims to enhance the grasp of the engine's architecture from a visual standpoint, further supporting the analysis and conclusions drawn by the authors."
  },
  {
    "hex_coord": [
      -3,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      900
    ],
    "summary": "The time-averaged Mach number contours within the study illustrate two characteristic features of a dual-mode scramjet. These features are crucial for understanding the performance dynamics of such propulsion systems, as they exhibit distinct patterns indicative of operational modes within scramjets. The analysis of these contours provides insights into the behavior of the flow fields, contributing to advancements in efficient high-speed aerial propulsion technology."
  },
  {
    "hex_coord": [
      -1,
      -8
    ],
    "country": 1,
    "MSU_ids": [
      922,
      954
    ],
    "summary": "The paper by M. Yuan, P. Wang, Y. Zhang, and their colleagues, published in Aerospace Science and Technology, focuses on advancements in aerospace technology. Through rigorous analysis, the study explores novel methodologies aimed at enhancing the efficiency and reliability of aerospace systems. The research employs dimensional reduction techniques to analyze complex datasets, enabling the identification of key patterns relevant to system performance. By utilizing these techniques, the authors were able to present a comprehensive layout of information that supports the development of cutting-edge solutions in aerospace applications. This paper contributes to the field by offering innovative approaches to tackle existing challenges, paving the way for future technological breakthroughs in aerospace science."
  },
  {
    "hex_coord": [
      6,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      927
    ],
    "summary": "The paper presents data for two distinct cases, with case 1 being displayed on the left and case 2 on the right."
  },
  {
    "hex_coord": [
      -10,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      961
    ],
    "summary": "The paper presents instantaneous snapshots illustrating the Mach number distribution, providing valuable insights into the flow dynamics and characteristics across the investigated domain. These snapshots serve as a critical tool for analyzing variations in velocity, pressure, and density fields, directly impacting the understanding of aerodynamic performance and efficiency. By visualizing the Mach number, the study facilitates improved interpretations of complex flow phenomena, enabling advancements in theoretical and practical applications within fluid dynamics."
  },
  {
    "hex_coord": [
      -6,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      976
    ],
    "summary": "In stage #1, the study observed a significant flashback phenomenon, a finding that is also clearly depicted in the initial phase of Figure 10. This flashback occurrence initially disrupts the system, indicating the early challenges encountered in the process and necessitating further investigation to understand its implications and underlying causes in the context of the study."
  },
  {
    "hex_coord": [
      -12,
      3
    ],
    "country": 1,
    "MSU_ids": [
      983
    ],
    "summary": "The significant pressure responses observed indicate the formation of a substantial separation zone in stage #3 of the experiment. This large-area separation suggests a considerable alteration in the flow dynamics, which can have impactful implications on the overall system performance. The observation of such pronounced pressure changes underscores the critical nature of this phase in the experimental process, highlighting the importance of understanding the separation mechanisms to optimize system functionality and efficiency."
  },
  {
    "hex_coord": [
      0,
      0
    ],
    "country": 1,
    "MSU_ids": [
      993
    ],
    "summary": "The study presents the waveform of flame oscillation observed in case 2, providing insights into the dynamic behavior of the flame under specified conditions. This waveform analysis is essential for understanding the oscillatory characteristics and potential stability issues associated with combustion processes in this scenario. By examining these oscillations, the research contributes to a deeper comprehension of flame dynamics, which is crucial for optimizing performance and safety in applicable combustion systems."
  },
  {
    "hex_coord": [
      -2,
      -9
    ],
    "country": 1,
    "MSU_ids": [
      1027
    ],
    "summary": "The snapshot Proper Orthogonal Decomposition (POD) method involves organizing the dataset into a matrix format, where each column represents a temporal discretization of the entire spatial grid. This arrangement facilitates the extraction of dominant modes of variability from the dataset, which are crucial for the dimensionality reduction process inherent in the POD technique. By transforming complex, high-dimensional data into a more manageable form, the snapshot POD method aids in identifying essential patterns and structures within the data over time."
  },
  {
    "hex_coord": [
      3,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      1028,
      1048
    ],
    "summary": "Through the calculation of the two-point space-correlation tensor in matrix form *C*, the study successfully obtained the eigenvalue *λ*, representing the modal energy, and the eigenvector *A* via eigendecomposition. These findings demonstrated the solver's capability to effectively model dual-mode scramjet combustion, highlighting its proficiency in capturing the complex interactions and energy distributions within the combustion process."
  },
  {
    "hex_coord": [
      2,
      -11
    ],
    "country": 1,
    "MSU_ids": [
      1030
    ],
    "summary": "In the study, the temporal coefficients *a(t)* are determined by projecting the original matrix onto the Proper Orthogonal Modes (POMs). This involves a computational process wherein the raw data matrix undergoes transformation to identify significant modes, enabling the analysis of temporal dynamics in a reduced dimensional space. This method effectively extracts meaningful temporal information by leveraging the spatial structure provided by the POMs, facilitating a more efficient and insightful examination of temporal patterns within the dataset."
  },
  {
    "hex_coord": [
      1,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      1034
    ],
    "summary": "Figure 15(b) illustrates the spatial structures of the first three Proper Orthogonal Modes (POMs)."
  },
  {
    "hex_coord": [
      0,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      1049
    ],
    "summary": "The paper demonstrates that the solver's effectiveness is substantiated through a combination of qualitative and quantitative analyses. Specifically, this is reflected in the optical diagnostic images, which visually depict the flow characteristics, the precise wall pressure measurements that offer quantitative data on the pressure field, and the Mach number distributions indicating the flow speed variations. Together, these elements affirm the solver's capability in accurately modeling and predicting the fluid dynamics involved."
  },
  {
    "hex_coord": [
      2,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      1070
    ],
    "summary": "Research into the utilization of ethylene as a fuel is crucial for advancing future developments."
  },
  {
    "hex_coord": [
      -1,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      1071
    ],
    "summary": "Research into the ram-to-scram transition process is critical for advancing future developments and technologies. This area of study focuses on the transition between ramjet and scramjet propulsion systems, which is pivotal for high-speed aeronautics and improving performance in related fields. Understanding this transition is essential for optimizing engine designs and ensuring efficient operation at varying speeds. As such, these investigations are fundamental for the progress and implementation of next-generation aerospace technologies."
  }
]